<?php
/*
=====================================================
 DataLife Engine - by SoftNews Media Group
-----------------------------------------------------
 http://dle-news.ru/
-----------------------------------------------------
 Copyright (c) 2004,2018 SoftNews Media Group
=====================================================
 Данный код защищен авторскими правами
=====================================================
 Файл: install.php
-----------------------------------------------------
 Назначение: Установка скрипта
=====================================================
*/
function startSession() {
    // Если сессия уже была запущена, прекращаем выполнение и возвращаем TRUE
    // (параметр session.auto_start в файле настроек php.ini должен быть выключен - значение по умолчанию)
    if ( session_id() ) return true;
    else return session_start();
    // Примечание: До версии 5.3.0 функция session_start()возвращала TRUE даже в случае ошибки.
    // Если вы используете версию ниже 5.3.0, выполняйте дополнительную проверку session_id()
    // после вызова session_start()
}

startSession();

@error_reporting ( E_ALL ^ E_WARNING ^ E_NOTICE );
@ini_set ( 'display_errors', true );
@ini_set ( 'html_errors', false );
@ini_set ( 'error_reporting', E_ALL ^ E_WARNING ^ E_NOTICE );

@ini_set ('memory_limit',"365M");
@set_time_limit (0);
@ini_set ('max_execution_time',0);
@ini_set ('3048M');
@ini_set ('output_buffering','off');

define('DATALIFEENGINE', true);
define('ROOT_DIR', dirname (__FILE__));
define('ENGINE_DIR', ROOT_DIR.'/engine');

$distr_charset = "windows-1251";
$db_charset = "cp1251";

header("Content-type: text/html; charset=".$distr_charset);

require_once(ROOT_DIR.'/language/Russian/adminpanel.lng');
require_once(ENGINE_DIR.'/inc/include/functions.inc.php');


$skin_header = <<<HTML
<!doctype html>
<html>
<head>
  <meta charset="{$distr_charset}">
  <meta name="viewport" content="width=device-width, maximum-scale=1, initial-scale=1, user-scalable=0">
  <meta content="IE=edge,chrome=1" http-equiv="X-UA-Compatible">
  <title>DataLife Engine - Установка</title>
  <link href="engine/skins/stylesheets/application.css" media="screen" rel="stylesheet" type="text/css" />
  <script type="text/javascript" src="engine/skins/javascripts/application.js"></script>
</head>
<body>
<script language="javascript" type="text/javascript">
<!--
var dle_act_lang   = ["Да", "Нет", "Ввод", "Отмена", "Загрузка изображений и файлов на сервер"];
var cal_language   = {en:{months:['Январь','Февраль','Март','Апрель','Май','Июнь','Июль','Август','Сентябрь','Октябрь','Ноябрь','Декабрь'],dayOfWeek:["Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб"]}};
//-->
</script>
<nav style="max-width:1220px;width:100%;margin:0 auto;" class="navbar navbar-default navbar-inverse navbar-static-top" role="navigation">
  <div class="navbar-header">
        <a class="navbar-brand" href="{$PHP_SELF}"><img src="/engine/skins/images/logo.png"></a>
  </div>
  <div style="float:right;margin-top:15px;" class="navbar-header">
  <b>Подпишись:</b> 
  <a rel="nofollow" href="https://vkontakte.ru/club13001075" target="_blank"><img src="/engine/skins/images/vkontakte.png" alt="Web2Work Group в Vkontakte"></a>  <a rel="nofollow" target="_blank" href="https://twitter.com/#!/web2work/web2work-group"><img src="/engine/skins/images/twitter.png" alt="Web2Work Group в Twitter"></a> <a href="https://google.com/+Web2workRus" rel="publisher" target="_blank"><img src="/engine/skins/images/gplus.png" alt="Web2Work Group в Google+"></a> <a href="https://www.facebook.com/pages/Web2Work-Group/121157691285563" rel="nofollow" target="_blank"><img src="/engine/skins/images/facebook.png" alt="Web2Work Group в Facebook"></a>  <a target="_blank" href="https://www.youtube.com/channel/UCs1yzsO9earP5yOXiMLGclw"><img style="width:32px;height:24px;" alt="youtube web2work" src="/engine/skins/images/yotubeaoui.jpg"></a>
</div>
<div style="clear:both;"></div>
</nav>
<div class="container">
  <div class="col-md-8 col-md-offset-2">
    <div class="padded">
	    <div style="margin-top: 10px;">
<!--MAIN area-->
HTML;


$skin_footer = <<<HTML
	 <!--MAIN area-->
    </div>
  </div>
</div>
</div>

</body>
</html>
HTML;

function msgbox($type, $title, $text, $back=FALSE){
global $lang, $skin_header, $skin_footer;

  if ($back) $back = "onclick=\"history.go(-1); return false;\""; else $back = "";

  echo $skin_header;

echo <<<HTML
<form action="install.php" method="get">
<div class="box">
  <div class="box-header">
    <div class="title">{$title}</div>
  </div>
  <div class="box-content">
	<div class="row box-section">
		{$text}
	</div>
	<div class="row box-section">
		<input {$back} class="btn btn-green" type=submit value="Продолжить">
	</div>

  </div>
</div>
</form>
HTML;

  echo $skin_footer;

  exit();
}

function GetRandInt($max){

	if(function_exists('openssl_random_pseudo_bytes') && (version_compare(PHP_VERSION, '5.3.4') >= 0 || strtoupper(substr(PHP_OS, 0, 3)) !== 'WIN')) {
	     do{
	         $result = floor($max*(hexdec(bin2hex(openssl_random_pseudo_bytes(4)))/0xffffffff));
	     }while($result == $max);
	} else {

		$result = mt_rand( 0, $max );
	}

    return $result;
}

function generate_auth_key() {

    $arr = array('a','b','c','d','e','f',
                 'g','h','i','j','k','l',
                 'm','n','o','p','r','s',
                 't','u','v','x','y','z',
                 'A','B','C','D','E','F',
                 'G','H','I','J','K','L',
                 'M','N','O','P','R','S',
                 'T','U','V','X','Y','Z',
                 '1','2','3','4','5','6',
                 '7','8','9','0','.',',',
                 '(',')','[',']','!','?',
                 '&','^','%','@','*',' ',
                 '<','>','/','|','+','-',
                 '{','}','`','~','#',';',
                 '/','|','=',':','`');

    $key = "";
    for($i = 0; $i < 64; $i++)
    {
      $index = GetRandInt(count($arr))-1;
      $key .= $arr[$index];
    }
    return $key;
}

extract($_REQUEST, EXTR_SKIP);

if($_REQUEST['action'] == "eula")
{

if ( !$_SESSION['dle_install'] ) msgbox( "", "Ошибка", "Установка скрипта была начата не с начала. Вернитесь на главную страницу начала установки скрипта: <br /><br /><a href=\"http://{$_SERVER['HTTP_HOST']}/install.php\">http://{$_SERVER['HTTP_HOST']}/install.php</a>" );

  echo $skin_header;

echo <<<HTML
<form id="check-eula" method="get" action="">
<input type=hidden name=action value="eulaweb2work">
<script language='javascript'>
function check_eula(){

	if( document.getElementById( 'eula' ).checked == true )
	{
		return true;
	}
	else
	{
		DLEalert( 'Вы должны принять лицензионное соглашение, прежде чем продолжите установку.', 'Информация' );
		return false;
	}
};
document.getElementById( 'check-eula' ).onsubmit = check_eula;
</script>
<div class="box">
  <div class="box-header">
    <div class="title">Лицензионное соглашение</div>
  </div>
  <div class="box-content">
	<div class="row box-section">
	Пожалуйста, внимательно прочитайте и примите пользовательское соглашение по использованию Web2Work.<br /><br />
		<div style="height: 300px; border: 1px solid #76774C; background-color: #FDFDD3; padding: 5px; overflow: auto;">
		<div style="text-align:left;">
		<p>Настоящее лицензионное соглашение заключается между пользователем программного продукта &laquo;ВЕБ-ПОРТАЛЫ WEB2WORK&raquo; - Программные продукты&raquo; и ООО "Веб2Ворк" разработчиком &laquo;ВЕБ-ПОРТАЛОВ WEB2WORK - Программные продукты&raquo;. Перед использованием продукта внимательно ознакомьтесь с условиями данного соглашения. Если вы не согласны с условиями данного соглашения, вы не можете использовать данный продукт. Установка и использование продукта означает ваше полное согласие со всеми пунктами настоящего соглашения.&nbsp;Вы должны быть ознакомлены, что&nbsp;&laquo;ВЕБ-ПОРТАЛЫ WEB2WORK&raquo; - Программные продукты&raquo;&nbsp;не подлежат возврату или обмену из-за отсутствия гарантий защищающих программный продукт от копирования.<br /><br /><strong>Основные термины настоящего соглашения:</strong><br /><br />&bull; ЭКЗЕМПЛЯР ПРОГРАММЫ - копия продуктов &laquo;ВЕБ-ПОРТАЛ &laquo;WEB2WORK&raquo; - Программные продукты&raquo;, включающая в себя исходный текст продукта и только одну копию структуры и таблиц базы данных, входящих в состав продукта, а также любую документацию по использованию продукта;<br />&bull; САЙТ, ИНТЕРНЕТ-ПРОЕКТ &ndash; совокупность данных одного ЭКЗЕМПЛЯРА ПРОГРАММЫ с уникальным идентификатором, с помощью которого группируются объекты программы (информационные блоки, веб-формы, форумы, шаблоны, шаблоны писем и другие) для их совместного отображения и использования, обычно в одном внешнем виде, языке интерфейса, доменном имени или каталоге. Каждому сайту соответствует запись в списке "Сайтов" меню "Настройки Системы".<br /><br /><strong><em><span style="color: #ff0000;">Лицензионное соглашение вступает в силу с момента приобретения продукта и действует на протяжении всего срока использования продукта.&nbsp;</span></em></strong><br /><br /><strong>1. Предмет лицензионного соглашения</strong><br /><br />1.1 Предметом настоящего лицензионного соглашения является право использования одного ЭКЗЕМПЛЯРА ПРОГРАММЫ, предоставляемое вам в порядке и на условиях, установленных настоящим соглашением.<br />1.2 Все положения настоящего соглашения распространяются как на все ЭКЗЕМПЛЯРЫ ПРОГРАММЫ&nbsp;в целом, так и на его отдельные компоненты. Пользователю предоставляется право создать два САЙТА на базе одного ЭКЗЕМПЛЯРА ПРОГРАММЫ. Создание большего числа САЙТОВ возможно только при условии оплаты стоимости дополнительных сайтов в порядке, предусмотренном п. 3.1. настоящего соглашения.<br />1.3 Лицензионное соглашение не предоставляет право собственности на ЭКЗЕМПЛЯР ПРОГРАММЫ&nbsp;и его компоненты, а только право использования ЭКЗЕМПЛЯРА ПРОГРАММЫ и его компонентов в соответствии с условиями, которые обозначены в пункте 3 настоящего соглашения.<br /><br /><strong>2. Авторские права</strong><br /><br />2.1 Продукт&nbsp;ЭКЗЕМПЛЯР ПРОГРАММЫ&nbsp;является интеллектуальной собственностью ООО "Веб2Ворк".<br />2.2 Всеми правами собственности и авторскими правами на продукт&nbsp;ЭКЗЕМПЛЯР ПРОГРАММЫ, включая документацию и исходный текст, обладает ООО "Веб2Ворк".</p>
<p>2.3 Продукт защищен Законом РФ &laquo;О правовой охране программ для электронных вычислительных машин и баз данных&raquo; от 23 ноября 2005 года, Законом РФ &laquo;Об авторском праве и смежных правах&raquo; от 9 октября 2005 года, а также международными договорами.&nbsp;<br />2.4 В случае нарушения авторских прав предусматривается ответственность в соответствии с действующим законодательством РФ.<br /><br /><strong>3. Условия использования продукта и ограничения</strong><br />&nbsp;<br />3.1 Настоящее соглашение предоставляет право установки приобретенного ЭКЗЕМПЛЯРА ПРОГРАММЫ в рамках одного интернет-проекта. Пользователь имеет право создать два САЙТА на базе одного ЭКЗЕМПЛЯРА ПРОГРАММЫ. Создание большего числа САЙТОВ возможно только при условии оплаты стоимости дополнительных сайтов. Стоимость дополнительного САЙТА, создаваемого на базе продукта, указана на интернет-сайте&nbsp;ЭКЗЕМПЛЯРА ПРОГРАММЫ.</p>
<p>3.2 Продукт может быть также использован при разработке одного Интернет-проекта на базе этого ЭКЗЕМПЛЯРА ПРОГРАММЫ для внутреннего использования. После завершения тестирования копия ЭКЗЕМПЛЯРА ПРОГРАММЫ должна быть немедленно удалена.<br />3.3 Пользователь не может копировать программу, передавать ее третьим лицам или распространять программу и ее компоненты, а также созданные на базе программы сайты, в любой форме, в том числе в виде исходного текста, каким-либо способом, в том числе сдавать в аренду/прокат программу и ее компоненты, а также созданные на ее базе сайты.<br />3.4 Пользователь может изменять, добавлять или удалять любые файлы приобретенного ЭКЗЕМПЛЯРА ПРОГРАММЫ в соответствии с Законодательством РФ об авторском праве. В таком случае ООО "Веб2Ворк" не гарантирует бесперебойную работу программы и обновлений.<br />3.5 Запрещается удалять любую информацию об авторских правах. &nbsp;<br />3.6 Запрещается любое использование системы, противоречащее действующему законодательству РФ.<br /><br /><strong>4. Ответственность сторон</strong><br />&nbsp;<br />4.1 За нарушение условий настоящего соглашения наступает ответственность, предусмотренная законодательством РФ.<br />4.2 ООО "Веб2Ворк" не несет ответственности перед пользователем продукта&nbsp;ЭКЗЕМПЛЯРА ПРОГРАММЫ&nbsp;за любой ущерб, любую потерю прибыли, информации или сбережений, связанных с использованием или с невозможностью использования продукта, даже в случае предварительного уведомления о возможности такого ущерба, или по любому иску третьей стороны.<br /><br /><strong>5. Ограниченная гарантия</strong><br /><br />5.1 ООО "Веб2Ворк" предоставляет услуги гарантийного обслуживания программного продукта в течение одного года с момента приобретения. Все положения настоящего пункта применяются только в течение срока действия гарантийного обслуживания.&nbsp;<br />5.2 Если при использовании продукта&nbsp;ЭКЗЕМПЛЯРА ПРОГРАММЫ&nbsp;будут обнаружены ошибки, ООО "Веб2Ворк" обязуется исправить их в максимально короткие сроки.</p>
<p>5.3 В случае несоблюдения пункта 3 настоящего соглашения, пользователь автоматически теряет предоставляемую гарантию.<br />5.4 При изменении цены и комплектации версий продукта&nbsp;ЭКЗЕМПЛЯРА ПРОГРАММЫ&nbsp;, ООО "Веб2Ворк" обязуется опубликовать единые условия соответствия старых версий новым версиям продукта. Продление технической поддержки на следующий год выполняется по цене новой версии продукта, действующей на момент продления.&nbsp; <br />5.5 Вы должны быть ознакомлены, что ЭКЗЕМПЛЯР ПРОГРАММЫ не подлежит возврату или обмену из-за отсутствия гарантий защищающих программный продукт от копирования.<br />&nbsp;<br /><strong>6. Условия технической поддержки</strong><br />&nbsp;<br />6.1 Приобретая продукт&nbsp;ЭКЗЕМПЛЯР ПРОГРАММЫ, пользователь получает возможность в течение одного года бесплатно пользоваться услугами технической поддержки ООО "Веб2Ворк". Все положения настоящего пункта действуют только в течение одного года с момента приобретения продукта и в течение дополнительно оплаченного периода технической поддержки.&nbsp;<br />6.2 Гарантийное обслуживание предусматривает устранение ошибок в ЭКЗЕМПЛЯРЕ ПРОГРАММЫ, выявленных в течение гарантийного периода, консультации по электронной почте и в специальном разделе сайта службы технической поддержки на сайте www.web2work.ru, ООО "Веб2Ворк" в течение гарантийного срока по рабочим дням (график выходных России) с 10 утра до 18 часов московского времени.<br />6.3 Пользователь продукта ЭКЗЕМПЛЯРА ПРОГРАММЫ может бесплатно скачивать новые версии продукта, изменения к модулям, примеры реализации тех или иных интерфейсов к продукту, обновления к ядру.<br />6.4 Пользователь продукта может регистрироваться в специальном разделе сайта службы технической поддержки и участвовать в специальном форуме между клиентами и сотрудниками для корректировки приоритетов в разработке новых модулей для будущих версий продукта.<br />6.5 Пользователю продукта предоставляется возможность размещать заявки на создание специализированных модулей на льготных условиях, а также заказывать на льготных условиях обновление между версиями продукта силами ООО "Веб2Ворк".&nbsp;<br />6.6 Пользователь продукта может приобрести дополнительный год технической поддержки за 30% текущей стоимости ЭКЗЕМПЛЯРА ПРОГРАММЫ. Техническая поддержка продлевается непрерывно. Срок действия техподдержки и обновлений продлевается на один год с момента завершения предыдущего периода. Полный прайс-лист для приобретения техподдержки указан на интернет-сайте www.web2work.ru.<br /><br /><strong>7. Изменение и расторжение соглашения</strong><br />&nbsp;<br />7.1 ООО "Веб2Ворк" оставляет за собой право внести изменения в настоящее соглашение в любой момент, опубликовав соответствующие изменения на своем интернет&ndash;сайте по адресу www.web2work.ru за 20 календарных дней до вступления этих изменений в силу.<br />7.2 В случае невыполнения пользователем одного из вышеуказанных положений, ООО "Веб2Ворк" имеет право в одностороннем порядке расторгнуть настоящее соглашение, уведомив об этом пользователя.<br />7.3 В случае если компетентный суд признает какие-либо положения настоящего соглашения недействительными, Соглашение продолжает действовать в остальной части.<br /><br /><strong><em><span style="color: #ff0000;">Настоящее лицензионное соглашение распространяется также на все новые версии продукта и все обновления, предоставляемые пользователю на условиях технической поддержки.&nbsp;</span></em></strong></p>
		</div></div>
		<br><br>
		Пожалуйста, внимательно прочитайте и примите пользовательское соглашение по использованию DataLife Engine.<br /><br /><div style="height: 300px; border: 1px solid #76774C; background-color: #FDFDD3; padding: 5px; overflow: auto;"><div style="text-align:center;"><b>Пользовательское лицензионное соглашение на использование программы для ЭВМ "DataLife Engine"</b></div><br /><!--colorstart:#FF0000--><span style="color:#FF0000"><!--/colorstart-->Уважаемый Пользователь! Перед началом установки, копирования либо иного использования Программы внимательно ознакомьтесь с условиями ее использования, содержащимися в настоящем Соглашении. Установка, запуск или иное начало использования Программы означает надлежащее заключение настоящего Соглашения и Ваше полное согласие со всеми его условиями. Если Вы не согласны безоговорочно принять условия настоящего Соглашения, Вы не имеете права устанавливать и использовать Программу и должны удалить все ее компоненты со своего компьютера (ЭВМ).<!--colorend--></span><!--/colorend--><br /><br />Настоящее лицензионное соглашение (далее – Соглашение) заключается между ООО «СофтНьюс Медиа Групп» (далее – Лицензиат) и любым физическим лицом, индивидуальным предпринимателем, юридическим лицом (далее – Пользователь).<br /><br /><div style="text-align:center;"><b>1. Основные термины</b></div><br /><b>1.1.</b> <b>Программа</b> – программа для ЭВМ "DataLife Engine", соответствующей версии (как в целом, так и ее компоненты), являющаяся представленной в объективной форме совокупностью данных и команд, в том числе, исходного текста, базы данных, аудиовизуальных произведений, включенных Лицензиатом в состав указанной программы для ЭВМ, а также любая документация по её использованию.<br /><br /><b>1.2. Использование программы</b> - любые действия, связанные с функционированием Программы в соответствии с ее назначением (в том числе запись в память ЭВМ).<br /><br /><b>1.3. Техническая поддержка</b> – мероприятия, осуществляемые Лицензиатом в установленных им пределах и объемах для обеспечения функционирования Программы, включая информационно-консультационную поддержку Пользователей по вопросам использования Программы.<br /><br /><b>1.4. Лицензиар</b> - собственник, владелец и правообладатель Программы, выдающий, другому лицу (Лицензиату) лицензию, предоставляющую право использования Программы в установленных Лицензионным договором пределах.<br /><br /><b>1.5. Лицензиат</b> - юридическое лицо или индивидуальный предприниматель, имеющие лицензию, в настоящем соглашении ООО «СофтНьюс Медиа Групп».<br /><br /><b>1.6. Пользователь</b> - физическое или юридическое лицо, или индивидуальный предприниматель, приобретающий лицензию на право использования DataLife Engine по данному лицензионному соглашению.<br /><br /><div style="text-align:center;"><b>2. Предмет лицензионного соглашения</b></div><br /><b>2.1.</b> Предметом настоящего лицензионного соглашения является право использования одной лицензионной копии программы для ЭВМ "DataLife Engine", в порядке и на условиях, установленных настоящим соглашением. Если вы не согласны с условиями данного соглашения, вы не можете использовать данный продукт. Установка и использование продукта означает ваше полное согласие со всеми пунктами настоящего соглашения.<br /><br /><b>2.2.</b> Все положения настоящего Соглашение распространяется как на Программу в целом, так и на её отдельные компоненты, за исключением случаев, когда для компонента системы применяется другой тип лицензии.<br /><br /><b>2.3.</b> Настоящее Соглашение заключается до или непосредственно в момент начала использования Программы и действует на протяжении всего срока ее правомерного использования Пользователем в пределах срока действия авторского права на нее при условии надлежащего соблюдения Пользователем условий настоящего Соглашения.<br /><br /><div style="text-align:center;"><b>3. Содержание договора</b></div><br /><b>3.1. </b>Срок обслуживания клиента с момента приобретения одной лицензионной копии Программы "DataLife Engine" равен одному году. Если по истечении срока обслуживания, Вы решите не продлевать его действие, то Ваша Программа будет функционировать в полном объеме, но без нашей технической поддержки и без предоставления новых версий Программы, за исключением критических обновлений Программы.<br /><br /><b>3.2. </b>Лицензиат осуществляет Техническую поддержку Пользователя, в том числе по вопросам, связанным с функциональностью, особенностями установки и эксплуатации на стандартных конфигурациях поддерживаемых (популярных) операционных, почтовых и иных систем Программы в порядке и на условиях, указанных в технической документации к ней.<br /><br /><b>3.3. </b>В случае приобретения и использования только базовой лицензии на Программу, обслуживание клиентов, на время действия лицензионного соглашения, ограничивается только предоставлением стандартных услуг по обслуживанию: предоставление дистрибутивов, новых версий Программы, критических обновлений Программы. Технической поддержки по базовым лицензиям не предоставляется. Для получения технической поддержки по Программе, пользователям необходимо иметь лицензию, включающую в себя службу технической поддержки, либо быть подписчиком на службу технической поддержки.<br /><br /><b>3.4. </b>В случае приобретения Пользователем Программы для передачи непосредственным заказчикам уже готового сайта или проекта, Пользователь обязан уведомить заказчика о настоящем лицензионном соглашении, а также полностью передать ему свой клиентский доступ на сайте dle-news.ru, в противном случае, Пользователем лицензии остается лицо непосредственно оплатившее лицензию, и имеющие клиентский доступ на сайте dle-news.ru. Третьим лицам, не имеющим данного доступа, в поддержке и предоставлению дистрибутивов будет отказано.<br /><br /><b>3.5. </b>Мы оставляем за собой право публиковать, с согласия пользователя программного продукта, списки избранных сайтов, на которых используется Программа "DataLife Engine". Мы оставляем за собой право в любое время изменять условия данного договора, но данные изменения не имеют обратной силы. Изменения данного договора будут разосланы пользователям по электронной почте на адреса, указанные при приобретении лицензии на Программу.<br /><br /><div style="text-align:center;"><b>4. Ограничения использования Программы</b></div><br /><b>4.1. </b>Программа является результатом интеллектуальной деятельности и объектом авторских прав (программа для ЭВМ), которые регулируются и защищены законодательством Российской Федерации об интеллектуальной собственности и нормами международного права.<br /><br /><b>4.2. </b>Название "DataLife Engine", а также входящие в данную Программу скрипты являются собственностью Лицензиара, использование которых возможно только в рамках данного соглашения, за исключением случаев, когда для компонента системы применяется другой тип лицензии. Любые публикуемые оригинальные материалы, создаваемые в результате использования нашей Программы, и связанные с этим права на них, являются собственностью пользователя и защищены законом. Лицензиар и Лицензиат не несут никакой ответственности за содержание сайтов, создаваемых пользователем Программы "DataLife Engine".<br /><br /><b>4.3. </b>Алгоритм работы Программы и ее исходные коды (в том числе их части) являются собственностью Лицензиара и Лицензиата. Любое их использование или использование Программы в нарушение условий настоящего Соглашения рассматривается как нарушение прав Лицензиара и является достаточным основанием для лишения Пользователя предоставленных по настоящему Соглашению прав.<br /><br /><b>4.4. </b>Лицензиат гарантирует, что обладает всеми необходимыми по настоящему Соглашению правами для предоставления их Пользователю, включая документацию к Программе.<br /><br /><b>4.5. </b>Приобретая лицензию на Программу "DataLife Engine", вы должны знать, что не приобретаете авторские права на Программу. Вы приобретаете только право на использование Программы на единственном веб сайте (одном домене второго уровня и его поддоменах), принадлежащем Вам или Вашему клиенту. Для использования Программы на другом сайте, вам необходимо приобретать повторную лицензию.<br /><br /><b>4.6. </b>Запрещается перепродажа Программы третьим лицам.<br /><br /><b>4.7. </b>Настоящим соглашением Пользователю не предоставляются никакие права на использование товарных знаков и знаков обслуживания Лицензиара, и Лицензиата.<br /><br /><b>4.8. </b>Пользователь не может ни при каких условиях удалять или изменять вид информации и сведения об авторских правах, правах на товарные знаки или патенты, указанные в исходном коде Программы.<br /><br /><div style="text-align:center;"><b>5. Права и обязанности сторон</b></div><br /><b>5.1. Пользователь имеет право:</b><br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.1.1 </b>Изменять дизайн и структуру программного кода в соответствии с нуждами своего сайта.<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.1.2 </b>Производить и распространять инструкции по созданным собственных модификациям шаблонов и языковых файлов, если в них будет иметься указание на оригинального разработчика программного продукта до Ваших модификаций. Модификации, произведенные Вами самостоятельно, не являются собственностью Лицензиара, если не содержат программные коды непосредственно Программы.<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.1.3 </b>Создавать дополнительные собственные модули для Программы, которые будут взаимодействовать с программными кодами Программы, с указанием на то, что это оригинальный продукт Пользователя.<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.1.4 </b>Переносить Программу на другой сайт после обязательного уведомления об этом Лицензиата, а также полного удаления Программы с предыдущего сайта.<br /><br /><b>5.2. Пользователь не имеет право:</b><br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.2.1</b> Передавать права на использование Программы  третьим лицам.<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.2.2 </b>Использовать или изменять структуру программных кодов, функции программы, с целью создания родственных продуктов.<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.2.3 </b>Создавать отдельные самостоятельные продукты, базирующиеся на нашем программном коде.<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.2.4 </b>Использовать копии Программы "DataLife Engine" по одной лицензии на более чем одном сайте (одном домене второго уровня и его поддоменах).<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.2.5 </b>Рекламировать, продавать или публиковать на своем сайте пиратские копии Программы.<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.2.6 </b>Распространять или содействовать распространению нелицензионных копий Программы "DataLife Engine".<br /><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>5.2.7 </b>Модифицировать и удалять механизмы проверки наличия оригинальной лицензии на использование Программы.<br /><br /><div style="text-align:center;"><b>6. Ограничение гарантийных обязательств</b></div><br /><b>6.1. </b>Мы хотим отметить, что механизмы безопасности, установленные на "DataLife Engine", имеют известные ограничения, и несмотря на то, что мы прилагаем максимальные усилия по обеспечению безопасности Программы, вы должны быть ознакомлены с отсутствием абсолютных гарантий от взлома вашего сайта. Так же наши гарантии и техническая поддержка не распространяются на модификации, произведенные третьей стороной, включая изменения программного кода, стиля, языковых пакетов, а также на изменения перечисленных частей, внесенные владельцем лицензии самостоятельно. Если Программа изменена Вами или третьей стороной, то мы вправе отказать Вам в технической поддержке.<br /><br /><b>6.2. </b>Программа "DataLife Engine" не подлежит возврату или обмену из-за отсутствия гарантий защищающих Программу от копирования.<br /><br /><div style="text-align:center;"><b>7. Досрочное расторжение договорных обязательств</b></div><br /><b>7.1. </b>Данное соглашение расторгается автоматически, если Вы отказываетесь выполнять условия нашего соглашения. Данное сублицензионное соглашение может быть расторгнуто нами в одностороннем порядке, в случае установления фактов нарушения данного сублицензионного соглашения. В случае досрочного расторжения соглашения Вы обязуетесь удалить все Ваши копии нашей Программы в течении 3 рабочих дней, с момента получения соответствующего уведомления.</div>
		<br /><br /><input type="checkbox" name="eula" id="eula" class="icheck"><label for="eula"> Я принимаю данные соглашения</label>
	</div>
	<div class="row box-section">
		<input class="btn btn-green" type="submit" value="Продолжить">
	</div>

  </div>
</div>
</form>
HTML;

} elseif($_REQUEST['action'] == "eulaweb2work")
{

if ( !$_SESSION['dle_install'] ) msgbox( "", "Ошибка", "Установка скрипта была начата не с начала. Вернитесь на главную страницу начала установки скрипта: <br /><br /><a href=\"http://{$_SERVER['HTTP_HOST']}/install.php\">http://{$_SERVER['HTTP_HOST']}/install.php</a>" );

  echo $skin_header;

    echo <<<HTML
<form  id="check-eula" method="post" action="">
<script language='javascript'>
function check_eula(){

	if( document.getElementById( 'eulaw2w' ).checked == true )
	{
		return true;
	}
	else
	{
		DLEalert( 'Вы должны подтвердить обработку персональных данных, прежде чем продолжите установку.', 'Информация' );
		return false;
	}
};
document.getElementById( 'check-eula' ).onsubmit = check_eula;
</script>
<input type=hidden name="action" value="install_video">
<div class="box">
  <div class="box-header">
    <div class="title">Активация установки</div>
  </div>
  <div class="box-content">
	<div class="row box-section">
	Активация системы проходит на нашем сервере https://web2work.ru/, поэтому убедитесь, что имеется интернет соединение. Вы можете перейти на страницу оплаты для получения ключа: <button class="btn btn-gray" type="button" onclick="location.href='https://web2work.ru'">Купить</button>
	<br>Если установка проходит на локальном компьютере обязательно пропускайте ввод ключа т.к после при первом вводе ключа сохраняется привязка к вашему домену. 
	<br>Лицензионный ключ имеет формат: <b>XXXX-XXXX-XXXX-XXXX</b><br><br>
<table width="100%">
HTML;


    echo '<tr>
<td width="175" style="padding: 5px;">Введите ключ для проверки лицензии:</td>
<td style="padding: 5px;"><input required name="keysa" placeholder="XXXX-XXXX-XXXX-XXXX"></td></tr>';

    echo <<<HTML
</table>
<br /><input type="checkbox" name="eulaw2w" id="eulaw2w" class="icheck"><label for="eula"> Подтверждаю обработку персональных данных при вводе ключа</label>
	</div>
	<div class="row box-section">
		<input class="btn btn-green" type=submit value="Продолжить">
	</div>

  </div>
</div></form>
HTML;

} elseif($_REQUEST['action'] == "install_video")
{

    if ($_REQUEST['keysa']) {
        $_IP = get_ip();
        if ($curl = curl_init()) {
            $data = file_get_contents("http://www.web2work.ru/extras/install.php?activation=" . $_REQUEST['keysa'] . "&domain=" . $_SERVER['SERVER_NAME'] . $_SERVER['REQUEST_URI'] . "&ip=" . $_IP . "&nextstep=1");
            echo $data;
            if ($data) {
                curl_setopt($curl, CURLOPT_URL, "http://www.web2work.ru/extras/install.php?activation=" . $_REQUEST['keysa'] . "&domain=" . $_SERVER['SERVER_NAME'] . $_SERVER['REQUEST_URI'] . "&ip=" . $_IP . "&nextstep=1");
                curl_setopt($curl, CURLOPT_RETURNTRANSFER, true);
                curl_setopt($curl, CURLOPT_POST, true);
                curl_setopt($curl, CURLOPT_FOLLOWLOCATION, true);
                curl_setopt($curl, CURLOPT_POSTFIELDS, "activation=" . $_REQUEST['keysa'] . "&domain=" . $_SERVER['SERVER_NAME'] . $_SERVER['REQUEST_URI'] . "&ip=" . $_IP . "&nextstep=1");
                $data = curl_exec($curl);
                curl_close($curl);
            }
        } else {
            $data = @file_get_contents("http://www.web2work.ru/extras/install.php?activation=" . $_REQUEST['keysa'] . "&domain=" . $_SERVER['SERVER_NAME'] . $_SERVER['REQUEST_URI'] . "&ip=" . $_IP . "&nextstep=1");
            header("REQUEST_METHOD: Post");
            header("activation: " . $_REQUEST['keysa'] . "");
            header("domain: " . $_SERVER['SERVER_NAME'] . $_SERVER['REQUEST_URI'] . "");
            header("ip: " . $_IP . "");
            header("nextstep: 1");
        }
    } else $_SESSION['dle_install'] = '';


        $data2 = @file_get_contents("http://www.web2work.ru/extras/install.php?activation=" . $_REQUEST['keysa'] . "&domain=" . $_SERVER['SERVER_NAME'] . $_SERVER['REQUEST_URI'] . "&ip=" . $_IP . "&nextstep=1");

        if ( $data or $data2 ) {
            $_SESSION['dle_install'] = '';
            msgbox("", "Ошибка", "Проверка ключа закончилась неудачей. ".$data2.". Вернитесь на главную страницу начала установки скрипта: <br /><br /><a href=\"http://{$_SERVER['HTTP_HOST']}/install.php\">http://{$_SERVER['HTTP_HOST']}/install.php</a>");

    }

if ( !$_SESSION['dle_install'] ) msgbox( "", "Ошибка", "Установка скрипта была начата не с начала. Вернитесь на главную страницу начала установки скрипта: <br /><br /><a href=\"http://{$_SERVER['HTTP_HOST']}/install.php\">http://{$_SERVER['HTTP_HOST']}/install.php</a>" );

  echo $skin_header;

echo <<<HTML
<form id="check-eula" method="get" action="">
<input type=hidden name=action value="function_check">
<script language='javascript'>
function check_eula(){
	if( document.getElementById( 'eulaw2w2' ).checked == true )
	{
		return true;
	}
	else
	{
		DLEalert( 'Вы должны ознакомиться с уведомлением по конфигурации сервера, прежде чем продолжите установку.', 'Информация' );
		return false;
	}
};
document.getElementById( 'check-eula' ).onsubmit = check_eula;
</script>
<div class="box">
  <div class="box-header">
    <div class="title">Установка системы</div>
  </div>
  <div class="box-content">
	<div class="row box-section">
	Пожалуйста, внимательно прочитайте уведомление по конфигурации сервера перед установкой.<br /><br />
		<div style="height: 300px; border: 1px solid #76774C; background-color: #FDFDD3; padding: 5px; overflow: auto;">
		<div style="text-align:left;">
		<b>1)</b> Во время установки системы, убедитесь, что на сервере под управлением <b>Linux</b>, права на папку с сайтом установлены которые используются скриптами. <br>Определить правильную установку на <b>Linux</b> не сложно, достаточно после установки открыть папку "<b>/engine/cache/</b>" и посмотреть есть ли данная папка и подпапки в ней. 
 <br>Команда для смены прав доступа на <b>Linux sudo chown -R user:group /home/user/dir/</b> где "<b>user</b>" это пользователь, а "<b>group</b>" это группа, вместо "<b>/home/user/dir/</b>" следует указать полный путь к папке сайта
 <br><br>
 <b>2)</b> Убедитесь, что на хостинге отключена функция <b>open_basedir</b> либо в конфигурации удален путь. Данный параметр влияет на автоматическую выгрузку и обновление информации.
</div>
</div>
<br /><br /><input type="checkbox" name="eulaw2w2" id="eulaw2w2" class="icheck"><label for="eula"> Ознакомлен</label>
	</div>
	<div class="row box-section">
		<input class="btn btn-green" type="submit" value="Продолжить">
	</div>

  </div>
</div>
</form>
HTML;

} elseif($_REQUEST['action'] == "function_check") {

    if ( !$_SESSION['dle_install'] ) msgbox( "", "Ошибка", "Установка скрипта была начата не с начала. Вернитесь на главную страницу начала установки скрипта: <br /><br /><a href=\"http://{$_SERVER['HTTP_HOST']}/install.php\">http://{$_SERVER['HTTP_HOST']}/install.php</a>" );

  echo $skin_header;

echo <<<HTML
<form method="get" action="">
<input type=hidden name="action" value="chmod_check">
<div class="box">
  <div class="box-header">
    <div class="title">Проверка установленных компонентов PHP</div>
  </div>
  <div class="box-content">
	<div class="row box-section">
<table class="table table-normal table-bordered">
<tr>
<td width="250">Минимальные требования скрипта</td>
<td colspan="2">Текущее значение</td>
</tr>
HTML;

    $status = phpversion() < '5.4' ? '<font color=red><b>Нет</b></font>' : '<font color=green><b>Да</b></font>';

   echo "<tr>
         <td>Версия PHP 5.4 и выше</td>
         <td colspan=2>$status</td>
         </tr>";

    $status = function_exists('mysqli_connect') ? '<font color=green><b>Да</b></font>' : '<font color=red><b>Нет</b></font>';

   echo "<tr>
         <td>Поддержка MySQLi</td>
         <td colspan=2>$status</td>
         </tr>";


    $status = extension_loaded('zlib') ? '<font color=green><b>Да</b></font>' : '<font color=red><b>Нет</b></font>';

   echo "<tr>
         <td>Поддержка сжатия ZLib</td>
         <td colspan=2>$status</td>
         </tr>";

    $status = extension_loaded('xml') ? '<font color=green><b>Да</b></font>' : '<font color=red><b>Нет</b></font>';

   echo "<tr>
         <td>Поддержка XML</td>
         <td colspan=2>$status</td>
         </tr>";

    $status = function_exists('mb_convert_encoding') ? '<font color=green><b>Да</b></font>' : '<font color=red><b>Нет</b></font>';;

   echo "<tr>
         <td>Поддержка многобайтных строк</td>
         <td colspan=2>$status</td>
         </tr>";

   echo "<tr>
         <td colspan=3><br />Если любой из этих пунктов выделен красным, то пожалуйста выполните действия для исправления положения. В случае несоблюдения минимальных требований скрипта возможна его некорректная работа в системе.<br /><br /></td>
         </tr>";

    echo "<tr>
    <td>Рекомендуемые настройки</td>
    <td width=\"200\">Рекомендуемое значение</td>
    <td>Текущее значение</td>
    </tr>";

    $status = ini_get('safe_mode') ? '<font color=red><b>Включено</b></font>' : '<font color=green><b>Выключено</b></font>';

    echo"<tr>
         <td>Safe Mode</td>
         <td>Выключено</td>
         <td>$status</td>
         </tr>";

    $status = ini_get('file_uploads') ? '<font color=green><b>Включено</b></font>' : '<font color=red><b>Выключено</b></font>';

    echo"<tr>
         <td>Загрузка файлов</td>
         <td>Включено</td>
         <td>$status</td>
         </tr>";

    $status = ini_get('output_buffering') ? '<font color=red><b>Включено</b></font>' : '<font color=green><b>Выключено</b></font>';

   echo "<tr>
         <td>Буферизация вывода</td>
         <td>Выключено</td>
         <td>$status</td>
         </tr>";

    $status = ini_get('magic_quotes_runtime') ? '<font color=red><b>Включено</b></font>' : '<font color=green><b>Выключено</b></font>';

   echo "<tr>
         <td>Magic Quotes Runtime</td>
         <td>Выключено</td>
         <td>$status</td>
         </tr>";

    $status = ini_get('register_globals') ? '<font color=red><b>Включено</b></font>' : '<font color=green><b>Выключено</b></font>';

   echo "<tr>
         <td>Register Globals</td>
         <td>Выключено</td>
         <td>$status</td>
         </tr>";

    $status = ini_get('session.auto_start') ? '<font color=red><b>Включено</b></font>' : '<font color=green><b>Выключено</b></font>';

   echo "<tr>
         <td>Session auto start</td>
         <td>Выключено</td>
         <td>$status</td>
         </tr>";

   echo "<tr>
         <td colspan=3 class=\"note lagre\"><br />Данные настройки являются рекомендуемыми для полной совместимости, однако скрипт способен работать даже если рекомендуемые настройки несовпадают с текущими.<br /><br /></td>
         </tr>";

echo <<<HTML
</table>
	</div>
	<div class="row box-section">
		<input class="btn btn-green" type=submit value="Продолжить">
	</div>

  </div>
</div></form>
HTML;

////////////////// ОПРЕДЕЛЯЮЩИЕ СБОРКИ /////////////////////////////

require_once(ROOT_DIR.'/install/sborka_key_e2.php');

////////////////////////////////////////////////////////////////////


}
// ********************************************************************************
// Проверка прав на запись
// ********************************************************************************
elseif($_REQUEST['action'] == "chmod_check")
{

if ( !$_SESSION['dle_install'] ) msgbox( "", "Ошибка", "Установка скрипта была начата не с начала. Вернитесь на главную страницу начала установки скрипта: <br /><br /><a href=\"http://{$_SERVER['HTTP_HOST']}/install.php\">http://{$_SERVER['HTTP_HOST']}/install.php</a>" );

  echo $skin_header;

echo <<<HTML
<form method="get" action="">
<input type=hidden name="action" value="doconfig">
<div class="box">
  <div class="box-header">
    <div class="title">Проверка на запись у важных файлов системы</div>
  </div>
  <div class="box-content">
	<div class="row box-section">
<table class="table table-normal table-bordered">
HTML;

echo"<thead><tr>
<td>Папка/Файл</td>
<td width=\"100\">CHMOD</td>
<td width=\"100\">Статус</td></tr></thead><tbody>";

$important_files = array(
'./backup/',
'./engine/',
'./engine/data/',
'./uploads/',
'./uploads/files/',
'./uploads/fotos/',
'./uploads/posts/',
'./uploads/posts/thumbs/',
'./uploads/posts/medium/',
'./uploads/thumbs/',
'./templates/',
'./templates/66-new/',
);


$chmod_errors = 0;
$not_found_errors = 0;
    foreach($important_files as $file){

        if(!file_exists($file)){
            $file_status = "<font color=red>не найден!</font>";
            $not_found_errors ++;
        }
        elseif(is_writable($file)){
            $file_status = "<font color=green>разрешено</font>";
        }
        else{
            @chmod($file, 0777);
            if(is_writable($file)){
                $file_status = "<font color=green>разрешено</font>";
            }else{
                @chmod("$file", 0755);
                if(is_writable($file)){
                    $file_status = "<font color=green>разрешено</font>";
                }else{
                    $file_status = "<font color=red>запрещено</font>";
                    $chmod_errors ++;
                }
            }
        }
        $chmod_value = @decoct(@fileperms($file)) % 1000;

    echo"<tr>
         <td>$file</td>
         <td>$chmod_value</td>
         <td>$file_status</td>
         </tr>";
    }

if($chmod_errors == 0 and $not_found_errors == 0){

    $status_report = 'Проверка успешно завершена! Можете продолжить установку!';

} else {

    if($chmod_errors > 0){
        $status_report = "<font color=red>Внимание!!!</font><br /><br />Во время проверки обнаружены ошибки: <b>$chmod_errors</b>. Запрещена запись в файл.<br />Вы должны выставить для папок CHMOD 777, для файлов CHMOD 666, используя ФТП-клиент.<br /><br /><font color=red><b>Настоятельно не рекомендуется</b></font> продолжать установку, пока не будут произведены изменения.<br />";
    }

    if($not_found_errors > 0){
        $status_report .= "<font color=red>Внимание!!!</font><br />Во время проверки обнаружены ошибки: <b>$not_found_errors</b>. Файлы не найдены!<br /><br /><font color=red><b>Не рекомендуется</b></font> продолжать установку, пока не будут произведены изменения.<br />";
    }
}

echo"<tr><td height=\"25\" colspan=3>&nbsp;&nbsp;Состояние проверки</td></tr><tr><td style=\"padding: 5px\" colspan=3>$status_report</td></tr>";

echo <<<HTML
</tbody></table>
	</div>
	<div class="row box-section">
		<input class="btn btn-green" type=submit value="Продолжить">
	</div>

  </div>
</div></form>
HTML;

} elseif($_REQUEST['action'] == "doconfig") {

    if ( !$_SESSION['dle_install'] ) msgbox( "", "Ошибка", "Установка скрипта была начата не с начала. Вернитесь на главную страницу начала установки скрипта: <br /><br /><a href=\"http://{$_SERVER['HTTP_HOST']}/install.php\">http://{$_SERVER['HTTP_HOST']}/install.php</a>" );


    $url  = preg_replace( "'/install.php'", "", $_SERVER['HTTP_REFERER']);
    $url  = preg_replace( "'\?(.*)'", "", $url);

    if(substr("$url", -1) == "/"){
        $url = substr($url, 0, -1);
    }

  echo $skin_header;

  echo <<<HTML
<form method="post" action="">
<input type=hidden name="action" value="doinstall">
<div class="box">
  <div class="box-header">
    <div class="title">Настройка конфигурации системы</div>
  </div>
  <div class="box-content">
	<div class="row box-section">
<table width="100%">
HTML;


echo '<tr>
<td width="175" style="padding: 5px;">URL сайта:
<td style="padding: 5px;"><input name=url value="'.$url.'/" size=38 type=text><br><span class="note large">Укажите путь без имени файла, знак слеша <font color="red">/</font> на конце обязателен</span></tr>
<tr><td colspan="3" height="40">&nbsp;&nbsp;<b>Данные для доступа к MySQL серверу</b><td></tr>
<tr><td style="padding: 5px;">Сервер MySQL:<td style="padding: 5px;"><input type=text size="28" name="dbhost" value="localhost"></tr>
<tr><td style="padding: 5px;">Имя базы данных:<td style="padding: 5px;"><input type=text size="28" name="dbname"></tr>
<tr><td style="padding: 5px;">Имя пользователя:<td style="padding: 5px;"><input type=text size="28" name="dbuser"></tr>
<tr><td style="padding: 5px;">Пароль:<td style="padding: 5px;"><input type=text size="28" name="dbpasswd"></tr>
<tr><td style="padding: 5px;">Префикс:<td style="padding: 5px;"><input type=text size="28" name="dbprefix" value="dle"> <span class="note large">Не изменяйте параметр, если не знаете для чего он предназначен</span></tr>
<tr><td colspan="3"  height="40">&nbsp;&nbsp;<b>Данные для доступа к панели управления</b><td></tr>
<tr><td style="padding: 5px;">Имя администратора:<td style="padding: 5px;"><input type=text size="28" name="reg_username" ></tr>
<tr><td style="padding: 5px;">Пароль:<td style="padding: 5px;"><input type=password size="28" name="reg_password1"> <span class="note large"><b>не</b> забудьте пароль!</span></tr>
<tr><td style="padding: 5px;">Повторите пароль:<td style="padding: 5px;"><input type=password size="28" name="reg_password2"></tr>
<tr><td style="padding: 5px;">E-mail:<td style="padding: 5px;"><input type=text size="28" name="reg_email"></tr>
<tr><td colspan="3"  height="40">&nbsp;&nbsp;<b>Дополнительные настройки</b><td></tr>
<tr><td style="padding: 5px;">Включить поддержку ЧПУ:
<td style="padding: 5px;">
<select class=rating name="alt_url"><option value="1">Да</option><option value="0">Нет</option></select>&nbsp;&nbsp;<span class="note large">Eсли вы отключите поддержку ЧПУ, то не забудьте удалить файл .htaccess в корневой папке</span>
</tr>';

echo <<<HTML
</table>
	</div>
	<div class="row box-section">
		<input class="btn btn-green" type=submit value="Продолжить">
	</div>

  </div>
</div></form>
HTML;

}
// ********************************************************************************
// Do Install
// ********************************************************************************
elseif($_REQUEST['action'] == "doinstall")
{

	if ( !$_SESSION['dle_install'] ) msgbox( "", "Ошибка", "Установка скрипта была начата не с начала. Вернитесь на главную страницу начала установки скрипта: <br /><br /><a href=\"http://{$_SERVER['HTTP_HOST']}/install.php\">http://{$_SERVER['HTTP_HOST']}/install.php</a>" );

    if(!$reg_username or !$reg_email or !$reg_password1 or !$url or $reg_password1 != $reg_password2){ msgbox("error", "Ошибка!!!" ,"Заполните необходимые поля!", "history.go(-1)"); }
	if (preg_match("/[\||\'|\<|\>|\[|\]|\"|\!|\?|\$|\@|\#|\/|\\\|\&\~\*\{\+]/", $reg_username))
	{
		msgbox("error", "Ошибка!!!" ,"Введенное имя администратора недопустимо к регистрации!", "history.go(-1)");
	}

    $reg_password = md5(md5($reg_password1));

 	if( ! $handle = opendir( "./templates" ) ) {
		die( "Невозможно открыть директорию ./templates" );
	}
	while ( false !== ($file = readdir( $handle )) ) {
		if( is_dir( ROOT_DIR . "/templates/$file" ) and ($file != "." and $file != "..") ) {
			if ($file=='66-reborn' or $file=='e1-reborn-portal' or $file=='66-new' or $file=='uralweb-professional') {
				if ($file=='66-new') $file='66-new';
				$sys_con_skins_arr = $file;
			}
		}
	}
	closedir( $handle );

	$url = htmlspecialchars( $url, ENT_QUOTES, 'ISO-8859-1');
	$reg_email = htmlspecialchars( $reg_email, ENT_QUOTES, 'ISO-8859-1');
	$alt_url = intval( $alt_url );
	$url = str_replace( "$", "&#036;", $url );
	$reg_email = str_replace( "$", "&#036;", $reg_email );
	$timezone = date_default_timezone_get();

	$timezones = array('Pacific/Midway','US/Samoa','US/Hawaii','US/Alaska','US/Pacific','America/Tijuana','US/Arizona','US/Mountain','America/Chihuahua','America/Mazatlan','America/Mexico_City','America/Monterrey','US/Central','US/Eastern','US/East-Indiana','America/Lima','America/Caracas','Canada/Atlantic','America/La_Paz','America/Santiago','Canada/Newfoundland','America/Buenos_Aires','Greenland','Atlantic/Stanley','Atlantic/Azores','Africa/Casablanca','Europe/Dublin','Europe/Lisbon','Europe/London','Europe/Amsterdam','Europe/Belgrade','Europe/Berlin','Europe/Bratislava','Europe/Brussels','Europe/Budapest','Europe/Copenhagen','Europe/Madrid','Europe/Paris','Europe/Prague','Europe/Rome','Europe/Sarajevo','Europe/Stockholm','Europe/Vienna','Europe/Warsaw','Europe/Zagreb','Europe/Athens','Europe/Bucharest','Europe/Helsinki','Europe/Istanbul','Asia/Jerusalem','Europe/Kiev','Europe/Minsk','Europe/Riga','Europe/Sofia','Europe/Tallinn','Europe/Vilnius','Asia/Baghdad','Asia/Kuwait','Africa/Nairobi','Asia/Tehran','Europe/Kaliningrad','Europe/Moscow','Europe/Volgograd','Europe/Samara','Asia/Baku','Asia/Muscat','Asia/Tbilisi','Asia/Yerevan','Asia/Kabul','Asia/Yekaterinburg','Asia/Tashkent','Asia/Kolkata','Asia/Kathmandu','Asia/Almaty','Asia/Novosibirsk','Asia/Jakarta','Asia/Krasnoyarsk','Asia/Hong_Kong','Asia/Kuala_Lumpur','Asia/Singapore','Asia/Taipei','Asia/Ulaanbaatar','Asia/Urumqi','Asia/Irkutsk','Asia/Seoul','Asia/Tokyo','Australia/Adelaide','Australia/Darwin','Asia/Yakutsk','Australia/Brisbane','Pacific/Port_Moresby','Australia/Sydney','Asia/Vladivostok','Asia/Sakhalin','Asia/Magadan','Pacific/Auckland','Pacific/Fiji');

	if ( !in_array($timezone, $timezones) ) {
		$timezone = "Europe/Moscow";
		date_default_timezone_set ( $timezone );
	}

$config = <<<HTML
<?PHP

//System Configurations

\$config = array (

'tip_main' => "0",

'convert_vkontakt' => "yes",

'block_obrazovanie' => "4",

'block_kurs' => "1",

'block_vpred' => "0",

'block_news' => "1",

'block_afishan' => "1",

'block_mesta' => "1",

'block_doska' => "1",

'block_lastphoto' => "1",

'block_lastvrolic' => "1",

'block_lastmfile' => "1",

'block_ratsite' => "1",

'block_leftmenu' => "1",

'showforums_block' => "1",

'block_licghclb' => "1",

'block_fotocz' => "1",

'wetr_block' => "1",

'search_m_block' => "1",

'galeryuser_block' => "1",

'hochuobsh_block' => "1",

'gor_pred_block' => "1",

'panel_block' => "1",

'kartochka_block' => "1",

'myclubizm_block' => "1",

'valutasite' => "Рубли",

'valutasitez' => "руб",

'regpay' => "0",

'firmpay' => "0",

'firmpay_google' => "1",

'paykolsf' => "40",

'smshochuobsh' => "100",

'smsprofile' => "40",

'smsprofile1' => "",

'smsprofile2' => "",

'smsanketa' => "30",

'smsupdat' => "10",

'smsobj' => "100",

'smsdelphoto' => "50",

'smsphoto' => "100",

'smskrediti' => "50",

'smspodarok' => "4",

'ur_name' => "ООО &quot;Веб2Ворк&quot;",

'ur_inn' => "ИНН",

'ur_kpp' => "КПП",

'ur_ad' => "г.Екатеринбург, ул.Мичурина, д.210",

'ur_add' => "г.Екатеринбург, ул.Мичурина, д.210",

'ur_phone' => "8-800-2000-600",

'ur_fio' => "Фамилия Имя Отчество",

'ur_mob' => "8-800-2000-600",

'http_home_url_ulo' => "",

'http_home_url_b1g' => "",

'reg_group_loginza' => "4",

'version_id' => "12.2",

'home_title' => "Web2Work - Городские и региональные порталы",

'http_home_url' => "{$url}",

'charset' => "{$distr_charset}",

'admin_mail' => "{$reg_email}",

'description' => "Демонстрационная страница движка Web2Work",

'keywords' => "Веб2Ворк, Web2Work, CMS, PHP движок, веб-портал, портал",

'date_adjust' => "{$timezone}",

'site_offline' => "0",

'allow_alt_url' => "{$alt_url}",

'langs' => "Russian",

'skin' => "{$sys_con_skins_arr}",

'allow_gzip' => "1",

'allow_admin_wysiwyg' => "0",

'allow_static_wysiwyg' => "0",

'news_number' => "10",

'timestamp_active' => "j-m-Y, H:i",

'news_sort' => "date",

'news_msort' => "DESC",

'hide_full_link' => "0",

'allow_site_wysiwyg' => "0",

'allow_comments' => "1",

'comm_nummers' => "30",

'comm_msort' => "ASC",

'flood_time' => "30",

'auto_wrap' => "80",

'timestamp_comment' => "j F Y H:i",

'allow_comments_wysiwyg' => "0",

'allow_registration' => "1",

'allow_cache' => "1",

'allow_votes' => "1",

'allow_topnews' => "1",

'allow_read_count' => "1",

'allow_calendar' => "1",

'allow_archives' => "1",

'files_allow' => "1",

'files_count' => "1",

'reg_group' => "4",

'registration_type' => "0",

'allow_sec_code' => "1",

'allow_skin_change' => "1",

'max_users' => "0",

'max_users_day' => "0",

'kolmuz' => "5",

'kolvidss' => "5",

'kolfotos' => "6",

'redirect_register' => "2",

'user_online' => "1",

'status_user_online' => "Online",

'status_user_offline' => "Offline",

'max_up_size' => "200000000",

'max_image_days' => "2",

'allow_watermark' => "1",

'max_watermark' => "150",

'max_image' => "450",

'galery_max_image' => "46x62",

'galery_max_image_us2' => "166x111",

'lphalb_max_image' => "174x126",

'lphalb2_max_image' => "174x126",

'lphalb_count_image' => "4",

'lfirm_max_image' => "179x70",

'lmark_max_image' => "100x100",

'doska_max_image' => "60x60",

'doska_t_max_image' => "350x500",

'avtomoto_max_image' => "130x90",

'lclub_max_image' => "150x150",

'lcluba_max_image' => "150x150",

'arvid_max_image' => "80x80",

'aafishag_max_image' => "560x315",

'aafishao_max_image' => "176x99",

't_seite' => "0",

'jpeg_quality' => "100",

'files_antileech' => "1",

'allow_banner' => "1",

'log_hash' => "0",

'show_sub_cats' => "1",

'tag_img_width' => "0",

'mail_metod' => "php",

'smtp_host' => "localhost",

'smtp_port' => "25",

'smtp_user' => "",

'smtp_pass' => "",

'mail_bcc' => "0",

'speedbar' => "1",

'extra_login' => "0",

'image_align' => "left",

'ip_control' => "1",

'cache_count' => "0",

'related_news' => "1",

'no_date' => "1",

'mail_news' => "1",

'mail_comments' => "1",

'admin_path' => "admin.php",

'rss_informer' => "1",

'allow_cmod' => "0",

'max_up_side' => "0",

'files_force' => "1",

'short_rating' => "1",

'full_search' => "0",

'allow_multi_category' => "1",

'short_title' => "Демонстрационный сайт",

'allow_rss' => "1",

'rss_mtype' => "0",

'rss_number' => "10",

'rss_format' => "1",

'comments_maxlen' => "3000",

'offline_reason' => "Сайт находится на текущей реконструкции, после завершения всех работ сайт будет открыт.<br /><br />Приносим вам свои извинения за доставленные неудобства.",

'catalog_sort' => "date",

'catalog_msort' => "DESC",

'related_number' => "5",

'seo_type' => "0",

'mapsonsite' => "1",

'sotmarid' => "37675",

'news_redirect' => "1",

'shab_market' => "0",

'shab_clubizm' => "0",

'max_moderation' => "0",

'allow_quick_wysiwyg' => "0",

'sec_addnews' => "2",

'mail_pm' => "1",

'allow_change_sort' => "1",

'registration_rules' => "1",

'allow_tags' => "1",

'allow_add_tags' => "1",

'allow_fixed' => "1",

'max_file_count' => "0",

'allow_smartphone' => "0",

'allow_smart_images' => "0",

'allow_smart_video' => "0",

'allow_search_print' => "1",

'allow_search_link' => "1",

'allow_smart_format' => "1",

'thumb_dimming' => "0",

'thumb_gallery' => "1",

'max_comments_days' => "0",

'allow_combine' => "1",

'allow_subscribe' => "1",

'parse_links' => "0",

't_seite' => "0",

'comments_minlen' => "10",

'js_min' => "0",

'outlinetype' => "0",

'fast_search' => "1",

'login_log' => "5",

'allow_recaptcha' => "0",

'recaptcha_public_key' => "",

'recaptcha_private_key' => "",

'search_number' => "10",

'news_navigation' => "1",

'smtp_mail' => "",

'seo_control' => "0",

'news_restricted' => "0",

'comments_restricted' => "0",

'auth_metod' => "0",

'comments_ajax' => "0",

'create_catalog' => "0",

'mobile_news' => "10",

'reg_question' => "0",

'news_future' => "0",

'cache_type' => "0",

'memcache_server' => "localhost:11211",

'allow_comments_cache' => "1",

'reg_multi_ip' => "1",

'top_number' => "10",

'tags_number' => "40",

'mail_title' => "",

'o_seite' => "0",

'online_status' => "1",

'avatar_size' => "100",

'allow_share' => "1",

'auth_domain' => "0",

'start_site' => "1",

'clear_cache' => "0",

'allow_complaint_mail' => "0",

'spam_api_key' => "",

'create_metatags' => '1',

'admin_allowed_ip' => '',

'related_only_cats' => '0',

'allow_links' => '1',

'comments_lazyload' => '0',

'version_w2w_id' => "10.0",

'smskey_id_qiwi' => "{$_REQUEST[qiwi_id]}",

'smskey_id' => "{$_REQUEST[smscoin_id]}",

's_language' => "russian",

's_enc' => "windows-1251",

'sms_start_tag' => "hide",

'sms_end_tag' => "hide",

'robokassa' => "1",

'qiwi' => "1",

'interkassa' => "1",

'onpay' => "1",

'sber' => "1",

'webmoney' => "1",

'sms' => "1",

'paypal' => "1",

'pay_wm_wmid' => "{$_REQUEST[webmoney_wmid]}",

'pay_wm_interkassa' => "FA4D7CD3-25DE-133C-E61E-6337C33981D7",

'pay_wm_robokassa' => "{$_REQUEST[robokassa_login]}",

'pay_ps_robokassa' => "{$_REQUEST[robokassa_pass]}",

'pay_wm_paypal' => "{$_REQUEST[paypal_email]}",

'pay_wm_сat_amount_z' => "20.2",

'pay_wm_news_amount_z' => "15.1",

'pay_wm_сat_amount_r' => "200.0",

'pay_wm_news_amount_r' => "100.0",

'pay_wm_сat_amount_e' => "10.2",

'pay_wm_news_amount_e' => "5.1",

'pay_wm_purse_z' => "{$_REQUEST[webmoney_z]}",

'pay_wm_purse_r' => "{$_REQUEST[webmoney_r]}",

'pay_wm_purse_e' => "",

'pay_сat_period' => "15",

'pay_news_period' => "1",

'pay_secret_key' => "SecretKey",

'pay_sms_id' => "{$_REQUEST[smscoin_id]}",

'category_separator' => '/',

'speedbar_separator' => '',

'adminlog_maxdays' => '30',

'allow_social' => '0',

'medium_image' => '450',

'login_ban_timeout' => '20',

'watermark_seite' => '4',

'auth_only_social' => '0',

'rating_type' => '0',

'allow_comments_rating' => '1',

'comments_rating_type' => '1',

'tree_comments' => '0',

'tree_comments_level' => '5',

'simple_reply' => '0',

'recaptcha_theme' => "light",

'yandex_spam_check' => '0',

'yandex_api_key' => '',

'smtp_secure' => '',

'search_pages' => '5',

'profile_news' => '1',

'valuta_system_list' => '1,руб,RUB,Рубли|2,$,USD,Доллары|3,Euro,EUR,Евро',

'link_system_list' => '1,plus-square,Поиск лекарств,/pharmacy/,|2,calendar-alt,Афиша,/afisha/,|3,gift,Конкурс,/concurs/,|4,percent,Скидки,/skidki/,',

'link_foother_list' => '1,,О проекте,/about.html,|2,,Пользовательское соглашение,/agreement.html,|3,,Размещение рекламы,/advert/,|4,,Техподдержка,/feedback/,|5,,Web2Work Group,https://web2work.ru/,',

'blocks_system_list' => '1,menu_top,Верхнее меню,menu_top,|2,menu_bottom,Нижнее меню,menu_bottom,|3,hochuobsh,Хочу общаться,hochuobsh,|4,exclusive,Эксклюзивно,exclusive,',

'kurs_act' => '1',

'kurs_dollar' => '2',

'kurs_euro' => '1',

'kurs_text' => 'Курсы валют',

'wetr_act' => '1',

'probki_act' => '1',

'holiday_act' => '1',

'holiday_limit' => '3',

'nedv_act' => '1',

'nedv_limit' => '3',

'auto_act' => '1',

'auto_limit' => '3',

'work_act' => '1',

'work_type' => '1',

'work_limit' => '3',

'banki_act' => '1',

'banki_type' => '1',

'banki_limit' => '4',

'firmrek_act' => '1',

'firmrek_type' => '1',

'firmrek_limit' => '4',

'menu_news' => '4',

'menu_obj' => '4',

'menu_autoobj' => '4',

'menu_nedv' => '4',

'main_system_news' => '1,10#143#144#145#146#147,0,1,news_index_top|2,10#143#144#145#146#147,1,6,news_index_other|3,10#143#144#145#146#147,6,3,news_index_foto|4,10#143#144#145#146#147,0,7,news_index_other_block|5,10#143#144#145#146#147,0,2,news_index_foto|6,10#143#144#145#146#147,2,7,news_index_other_block|7,120,0,7,news_index_other_block',

'smilies' => 'bowtie,smile,laughing,blush,smiley,relaxed,smirk,heart_eyes,kissing_heart,kissing_closed_eyes,flushed,relieved,satisfied,grin,wink,stuck_out_tongue_winking_eye,stuck_out_tongue_closed_eyes,grinning,kissing,stuck_out_tongue,sleeping,worried,frowning,anguished,open_mouth,grimacing,confused,hushed,expressionless,unamused,sweat_smile,sweat,disappointed_relieved,weary,pensive,disappointed,confounded,fearful,cold_sweat,persevere,cry,sob,joy,astonished,scream,tired_face,angry,rage,triumph,sleepy,yum,mask,sunglasses,dizzy_face,imp,smiling_imp,neutral_face,no_mouth,innocent',

'rasp_url' => 'https://rasp.yandex.ru/',

'rasp_translit' => 'ru',

);

?>
HTML;

$dbhost = str_replace ('"', '\"', str_replace ("$", "\\$", $dbhost) );
$dbname = str_replace ('"', '\"', str_replace ("$", "\\$", $dbname) );
$dbuser = str_replace ('"', '\"', str_replace ("$", "\\$", $dbuser) );
$dbpasswd = str_replace ('"', '\"', str_replace ("$", "\\$", $dbpasswd) );
$dbprefix = str_replace ('"', '\"', str_replace ("$", "\\$", $dbprefix) );
$auth_key = generate_auth_key();

$dbconfig = <<<HTML
<?PHP

define ("DBHOST", "{$dbhost}");

define ("DBNAME", "{$dbname}");

define ("DBUSER", "{$dbuser}");

define ("DBPASS", "{$dbpasswd}");

define ("PREFIX", "{$dbprefix}");

define ("USERPREFIX", "{$dbprefix}");

define ("COLLATE", "{$db_charset}");

define('SECURE_AUTH_KEY', '{$auth_key}');

\$db = new db;

?>
HTML;


$video_config = <<<HTML
<?PHP

//Videoplayers Configurations

\$video_config = array (

'width' => "425",

'height' => "325",

'play' => "false",

'progressBarColor' => "0xFFFFFF",

'flv_watermark' => "1",

'tube_related' => "0",

'tube_dle' => "0",

'startframe' => "0",

'progressBarColor' => "0xFFFFFF",

'preview' => "1",

'buffer' => "3",

'autohide' => "0",

'flv_watermark_pos' => "left",

'flv_watermark_al' => "1",

'youtube_q' => "hd720",

'play' => "0",

'fullsizeview' => "2",

'audio_width' => "425",

'use_html5' => '1',

);

?>
HTML;


$social_config = <<<HTML
<?PHP

//Social Configurations

\$social_config = array (

'vk' => '0',

'vk_groups_block' => 'https://vk.com/public13001075',

'vk_groups_mode' => '0',

'share_block' => '<div class="share bggrins">
			<div>
				<div class="to">Считаешь эту страницу интересной? Поделись со всеми</div>
				<div class="where">Ведущий информационный портал</div>
			</div>
			<div class="padding">
				<script src="//yastatic.net/es5-shims/0.0.2/es5-shims.min.js"></script>
				<script src="//yastatic.net/share2/share.js"></script>
				<div class="ya-share2" data-services="vkontakte,facebook,odnoklassniki,moimir,gplus,twitter,viber,whatsapp,skype,telegram"> </div>

			</div>
		</div>',

'vkid' => '',

'vksecret' => '',

'od' => '0',

'odid' => '',

'odpublic' => '',

'odsecret' => '',

'fc' => '0',

'fcid' => '',

'fcsecret' => '',

'google' => '0',

'googleid' => '',

'googlesecret' => '',

'mailru' => '0',

'mailruid' => '',

'mailrusecret' => '',

'yandex' => '0',

'yandexid' => '',

'yandexsecret' => '',

);

?>
HTML;

$dbconfig2 = <<<HTML
<?PHP

\$hostname = "{$dbhost}";
\$username = "{$dbuser}";
\$password = "{$dbpasswd}";
\$database = "{$dbname}";
\$prefix = "{$dbprefix}";
\$text_1 = "Мой любимый клуб:";
\$text_2 = "1";
\$text_3 = "2";
\$club_1 = "В клубе:";
\$club_2 = "1";

?>
HTML;

$dbconfig4 = <<<HTML
<?PHP

\$config['video_cat'] = "18";
\$config['video_cat_other'] = "18";
\$config['video_multicat'] = "1";
\$config['video_catname'] = "onlinevideo";
\$config['video_ppage'] = "12";
\$config['video_cols'] = "4";
\$config['video_width'] = "140";
\$config['video_height'] = "180";
\$config['video_hs'] = "1";
\$config['video_cut'] = "20";
\$config['video_cut_cat'] = "%%";
\$config['video_cut_cat2'] = "%%";

?>
HTML;

$con_file = fopen("engine/data/config.php", "w+") or die("Извините, но невозможно создать файл <b>.engine/data/config.php</b>.<br />Проверьте правильность проставленного CHMOD!");
fwrite($con_file, $config);
fclose($con_file);
@chmod("engine/data/config.php", 0666);

$con_file = fopen("engine/data/dbconfig.php", "w+") or die("Извините, но невозможно создать файл <b>.engine/data/dbconfig.php</b>.<br />Проверьте правильность проставленного CHMOD!");
fwrite($con_file, $dbconfig);
fclose($con_file);
@chmod("engine/data/dbconfig.php", 0666);

$con_file = fopen("engine/data/videoconfig.php", "w+") or die("Извините, но невозможно создать файл <b>.engine/data/videoconfig.php</b>.<br />Проверьте правильность проставленного CHMOD!");
fwrite($con_file, $video_config);
fclose($con_file);
@chmod("engine/data/videoconfig.php", 0666);

$con_file = fopen("engine/data/socialconfig.php", "w+") or die("Извините, но невозможно создать файл <b>.engine/data/socialconfig.php</b>.<br />Проверьте правильность проставленного CHMOD!");
fwrite($con_file, $social_config);
fclose($con_file);
@chmod("engine/data/socialconfig.php", 0666);

$con_file = fopen("engine/data/wordfilter.db.php", "w+") or die("Извините, но невозможно создать файл <b>.engine/data/wordfilter.db.php</b>.<br />Проверьте правильность проставленного CHMOD!");
fwrite($con_file, '');
fclose($con_file);
@chmod("engine/data/wordfilter.db.php", 0666);

$con_file = fopen("engine/data/xfields.txt", "w+") or die("Извините, но невозможно создать файл <b>.engine/data/xfields.txt</b>.<br />Проверьте правильность проставленного CHMOD!");
fwrite($con_file, '');
fclose($con_file);
@chmod("engine/data/xfields.txt", 0666);

$con_file = fopen("engine/data/xprofile.txt", "w+") or die("Извините, но невозможно создать файл <b>.engine/data/xprofile.txt</b>.<br />Проверьте правильность проставленного CHMOD!");
fwrite($con_file, '');
fclose($con_file);
@chmod("engine/data/xprofile.txt", 0666);

$con_file = fopen("engine/data/resize_dbconfig.php", "w+") or die("Извините, но невозможно создать файл <b>.engine/data/resize_dbconfig.php</b>.<br />Проверьте правильность проставленного CHMOD!");
fwrite($con_file, $dbconfig2);
fclose($con_file);
@chmod("engine/data/resize_dbconfig.php", 0666);

$con_file = fopen("engine/data/video_config.php", "w+") or die("Извините, но невозможно создать файл <b>.engine/data/video_config.php</b>.<br />Проверьте правильность проставленного CHMOD!");
fwrite($con_file, $dbconfig4);
fclose($con_file);
@chmod("engine/data/video_config.php", 0666);

@unlink(ENGINE_DIR.'/cache/system/usergroup.php');
@unlink(ENGINE_DIR.'/cache/system/vote.php');
@unlink(ENGINE_DIR.'/cache/system/banners.php');
@unlink(ENGINE_DIR.'/cache/system/category.php');
@unlink(ENGINE_DIR.'/cache/system/banned.php');
@unlink(ENGINE_DIR.'/cache/system/cron.php');
@unlink(ENGINE_DIR.'/cache/system/informers.php');
@unlink(ENGINE_DIR.'/data/snap.db');

define ("PREFIX", $dbprefix);
define ("COLLATE", $db_charset);

$tableSchema = array();

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_category";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_category (
  `id` mediumint(8) NOT NULL auto_increment,
  `parentid` mediumint(8) NOT NULL default '0',
  `posi` mediumint(8) NOT NULL default '1',
  `name` varchar(50) NOT NULL default '',
  `alt_name` varchar(50) NOT NULL default '',
  `icon` varchar(200) NOT NULL default '',
  `skin` varchar(50) NOT NULL default '',
  `descr` varchar(200) NOT NULL default '',
  `keywords` text NOT NULL,
  `news_sort` varchar(10) NOT NULL default '',
  `news_msort` varchar(4) NOT NULL default '',
  `news_number` smallint(5) NOT NULL default '0',
  `short_tpl` varchar(40) NOT NULL default '',
  `full_tpl` varchar(40) NOT NULL default '',
  `metatitle` varchar(255) NOT NULL default '',
  `show_sub` tinyint(1) NOT NULL default '0',
  `allow_rss` tinyint(1) NOT NULL default '1',
  PRIMARY KEY  (`id`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

////////////////// ОПРЕДЕЛЯЮЩИЕ СБОРКИ /////////////////////////////

$tableSchema[] = "ALTER TABLE  `".PREFIX."_category` ADD  `setlinks` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_category` ADD  `forum_id` smallint(5) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_category` ADD  `catmain` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_category` ADD  `rate` float unsigned DEFAULT '0'";

////////////////// ОПРЕДЕЛЯЮЩИЕ СБОРКИ /////////////////////////////

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_comments";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_comments (
  `id` int(10) unsigned NOT NULL auto_increment,
  `post_id` int(11) NOT NULL default '0',
  `user_id` mediumint(8) NOT NULL default '0',
  `date` datetime NOT NULL default '0000-00-00 00:00:00',
  `autor` varchar(40) NOT NULL default '',
  `email` varchar(40) NOT NULL default '',
  `text` text NOT NULL,
  `ip` varchar(40) NOT NULL default '',
  `is_register` tinyint(1) NOT NULL default '0',
  `approve` tinyint(1) NOT NULL default '1',
  `rating` int(11) NOT NULL default '0',
  `vote_num` int(11) NOT NULL default '0',
  `parent` int(11) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `user_id` (`user_id`),
  KEY `post_id` (`post_id`),
  KEY `approve` (`approve`),
  KEY `parent` (`parent`),
  FULLTEXT KEY `text` (`text`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_email";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_email (
  `id` tinyint(3) unsigned NOT NULL auto_increment,
  `name` varchar(10) NOT NULL default '',
  `template` text NOT NULL,
  `use_html` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";


$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_flood";

$tableSchema[] = "CREATE TABLE  " . PREFIX . "_flood (
  `f_id` int(11) unsigned NOT NULL auto_increment,
  `ip` varchar(40) NOT NULL default '',
  `id` varchar(20) NOT NULL default '',
  `flag` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`f_id`),
  KEY `ip` (`ip`),
  KEY `id` (`id`),
  KEY `flag` (`flag`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_images";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_images (
  `id` int(10) unsigned NOT NULL auto_increment,
  `images` text NOT NULL,
  `news_id` int(10) NOT NULL default '0',
  `author` varchar(40) NOT NULL default '',
  `date` varchar(15) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `author` (`author`),
  KEY `news_id` (`news_id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_logs";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_logs (
  `id` int(10) unsigned NOT NULL auto_increment,
  `news_id` int(10) NOT NULL default '0',
  `member` varchar(40) NOT NULL default '',
  `ip` varchar(40) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `news_id` (`news_id`),
  KEY `member` (`member`),
  KEY `ip` (`ip`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_logs` ADD `rating` TINYINT(4) NOT NULL DEFAULT '0'";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_vote";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_vote (
  `id` mediumint(8) NOT NULL auto_increment,
  `category` text NOT NULL,
  `vote_num` mediumint(8) NOT NULL default '0',
  `date` varchar(25) NOT NULL default '0',
  `title` varchar(200) NOT NULL default '',
  `body` text NOT NULL,
  `approve` tinyint(1) NOT NULL default '1',
  `start` varchar(15) NOT NULL default '',
  `end` varchar(15) NOT NULL default '',
  `grouplevel` varchar(250) NOT NULL default 'all',
  PRIMARY KEY  (`id`),
  KEY `approve` (`approve`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_vote_result";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_vote_result (
  `id` int(10) NOT NULL auto_increment,
  `ip` varchar(40) NOT NULL default '',
  `name` varchar(40) NOT NULL default '',
  `vote_id` mediumint(8) NOT NULL default '0',
  `answer` tinyint(3) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `answer` (`answer`),
  KEY `vote_id` (`vote_id`),
  KEY `ip` (`ip`),
  KEY `name` (`name`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_lostdb";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_lostdb (
  `id` mediumint(8) NOT NULL auto_increment,
  `lostname` mediumint(8) NOT NULL default '0',
  `lostid` varchar( 40 ) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `lostid` (`lostid`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_pm";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_pm (
  `id` int(11) unsigned NOT NULL auto_increment,
  `subj` varchar(255) NOT NULL default '',
  `text` text NOT NULL,
  `user` MEDIUMINT(8) NOT NULL default '0',
  `user_from` varchar(40) NOT NULL default '',
  `date` int(11) unsigned NOT NULL default '0',
  `pm_read` TINYINT(1) NOT NULL default '0',
  `folder` varchar(10) NOT NULL default '',
  `reply` tinyint(1) NOT NULL default '0',
  `sendid` int(10) unsigned NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `folder` (`folder`),
  KEY `user` (`user`),
  KEY `user_from` (`user_from`),
  KEY `pm_read` (`pm_read`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_post";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_post (
  `id` int(11) NOT NULL auto_increment,
  `autor` varchar(40) NOT NULL default '',
  `date` datetime NOT NULL default '0000-00-00 00:00:00',
  `short_story` text NOT NULL,
  `full_story` text NOT NULL,
  `xfields` text NOT NULL,
  `title` varchar(255) NOT NULL default '',
  `descr` varchar(200) NOT NULL default '',
  `keywords` text NOT NULL,
  `category` varchar(200) NOT NULL default '0',
  `alt_name` varchar(200) NOT NULL default '',
  `comm_num` mediumint(8) unsigned NOT NULL default '0',
  `allow_comm` tinyint(1) NOT NULL default '1',
  `allow_main` tinyint(1) unsigned NOT NULL default '1',
  `approve` tinyint(1) NOT NULL default '0',
  `fixed` tinyint(1) NOT NULL default '0',
  `allow_br` tinyint(1) NOT NULL default '1',
  `symbol` varchar(3) NOT NULL default '',
  `tags` VARCHAR(255) NOT NULL default '',
  `metatitle` varchar(255) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `autor` (`autor`),
  KEY `alt_name` (`alt_name`),
  KEY `category` (`category`),
  KEY `approve` (`approve`),
  KEY `allow_main` (`allow_main`),
  KEY `date` (`date`),
  KEY `symbol` (`symbol`),
  KEY `comm_num` (`comm_num`),
  KEY `tags` (`tags`),
  KEY `fixed` (`fixed`),
  FULLTEXT KEY `short_story` (`short_story`,`full_story`,`xfields`,`title`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_post_extras";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_post_extras (
  `eid` int(11) NOT NULL AUTO_INCREMENT,
  `news_id` int(11) NOT NULL DEFAULT '0',
  `news_read` int(11) NOT NULL DEFAULT '0',
  `allow_rate` tinyint(1) NOT NULL DEFAULT '1',
  `rating` int(11) NOT NULL DEFAULT '0',
  `vote_num` int(11) NOT NULL DEFAULT '0',
  `votes` tinyint(1) NOT NULL DEFAULT '0',
  `view_edit` tinyint(1) NOT NULL DEFAULT '0',
  `disable_index` tinyint(1) NOT NULL DEFAULT '0',
  `related_ids` varchar(255) NOT NULL DEFAULT '',
  `access` varchar(150) NOT NULL DEFAULT '',
  `editdate` int(11) NOT NULL DEFAULT '0',
  `editor` varchar(40) NOT NULL DEFAULT '',
  `reason` varchar(255) NOT NULL DEFAULT '',
  `user_id` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`eid`),
  KEY `news_id` (`news_id`),
  KEY `user_id` (`user_id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_static";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_static (
  `id` MEDIUMINT(8) NOT NULL auto_increment,
  `name` varchar(100) NOT NULL default '',
  `descr` varchar(255) NOT NULL default '',
  `template` text NOT NULL,
  `allow_br` tinyint(1) NOT NULL default '0',
  `allow_template` tinyint(1) NOT NULL default '0',
  `grouplevel` varchar(100) NOT NULL default 'all',
  `tpl` varchar(40) NOT NULL default '',
  `metadescr` varchar(200) NOT NULL default '',
  `metakeys` text NOT NULL,
  `views` mediumint(8) NOT NULL default '0',
  `template_folder` varchar(50) NOT NULL default '',
  `date` int(11) unsigned NOT NULL default '0',
  `metatitle` varchar(255) NOT NULL default '',
  `allow_count` tinyint(1) NOT NULL default '1',
  `sitemap` tinyint(1) NOT NULL default '1',
  `disable_index` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `name` (`name`),
  FULLTEXT KEY `template` (`template`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_users";

$tableSchema[] = "CREATE TABLE " . PREFIX . "_users (
  `email` varchar(50) NOT NULL default '',
  `password` varchar(32) NOT NULL default '',
  `name` varchar(40) NOT NULL default '',
  `user_id` int(11) NOT NULL auto_increment,
  `news_num` mediumint(8) NOT NULL default '0',
  `comm_num` mediumint(8) NOT NULL default '0',
  `user_group` smallint(5) NOT NULL default '4',
  `lastdate` varchar(20) default NULL,
  `reg_date` varchar(20) default NULL,
  `banned` varchar(5) NOT NULL default '',
  `allow_mail` tinyint(1) NOT NULL default '1',
  `info` text NOT NULL,
  `signature` text NOT NULL,
  `foto` varchar(255) NOT NULL default '',
  `fullname` varchar(100) NOT NULL default '',
  `land` varchar(100) NOT NULL default '',
  `favorites` text NOT NULL,
  `pm_all` smallint(5) NOT NULL default '0',
  `pm_unread` smallint(5) NOT NULL default '0',
  `time_limit` varchar(20) NOT NULL default '',
  `xfields` text NOT NULL,
  `allowed_ip` varchar(255) NOT NULL default '',
  `hash` varchar(32) NOT NULL default '',
  `logged_ip` varchar(40) NOT NULL default '',
  `restricted` TINYINT(1) NOT NULL default '0',
  `restricted_days` SMALLINT(4) NOT NULL default '0',
  `restricted_date` VARCHAR(15) NOT NULL default '',
  `timezone` VARCHAR(100) NOT NULL default '',
  `icq` varchar(20) NOT NULL default '',
  PRIMARY KEY  (`user_id`),
  UNIQUE KEY `name` (`name`),
  UNIQUE KEY `email` (`email`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_banned";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_banned (
  `id` smallint(5) NOT NULL auto_increment,
  `users_id` mediumint(8) NOT NULL default '0',
  `descr` text NOT NULL,
  `date` varchar(15) NOT NULL default '',
  `days` smallint(4) NOT NULL default '0',
  `ip` varchar(50) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `user_id` (`users_id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_files";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_files (
  `id`  MEDIUMINT(8) NOT NULL auto_increment,
  `news_id` int(10) NOT NULL default '0',
  `name` varchar(250) NOT NULL default '',
  `onserver` varchar(250) NOT NULL default '',
  `author` varchar(40) NOT NULL default '',
  `date` varchar(15) NOT NULL default '',
  `dcount` mediumint(8) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `news_id` (`news_id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_usergroups";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_usergroups (
  `id` smallint(5) NOT NULL auto_increment,
  `group_name` varchar(32) NOT NULL default '',
  `allow_cats` text NOT NULL,
  `allow_adds` tinyint(1) NOT NULL default '1',
  `cat_add` text NOT NULL,
  `allow_admin` tinyint(1) NOT NULL default '0',
  `allow_addc` tinyint(1) NOT NULL default '0',
  `allow_editc` tinyint(1) NOT NULL default '0',
  `allow_delc` tinyint(1) NOT NULL default '0',
  `edit_allc` tinyint(1) NOT NULL default '0',
  `del_allc` tinyint(1) NOT NULL default '0',
  `moderation` tinyint(1) NOT NULL default '0',
  `allow_all_edit` tinyint(1) NOT NULL default '0',
  `allow_edit` tinyint(1) NOT NULL default '0',
  `allow_pm` tinyint(1) NOT NULL default '0',
  `max_pm` smallint(5) NOT NULL default '0',
  `max_foto` VARCHAR(10) NOT NULL default '',
  `allow_files` tinyint(1) NOT NULL default '0',
  `allow_hide` tinyint(1) NOT NULL default '1',
  `allow_short` tinyint(1) NOT NULL default '0',
  `time_limit` tinyint(1) NOT NULL default '0',
  `rid` smallint(5) NOT NULL default '0',
  `allow_fixed` tinyint(1) NOT NULL default '0',
  `allow_feed`  tinyint(1) NOT NULL default '1',
  `allow_search`  tinyint(1) NOT NULL default '1',
  `allow_poll`  tinyint(1) NOT NULL default '1',
  `allow_main`  tinyint(1) NOT NULL default '1',
  `captcha`  tinyint(1) NOT NULL default '0',
  `icon` varchar(200) NOT NULL default '',
  `allow_modc`  tinyint(1) NOT NULL default '0',
  `allow_rating` tinyint(1) NOT NULL default '1',
  `allow_offline` tinyint(1) NOT NULL default '0',
  `allow_image_upload` tinyint(1) NOT NULL default '0',
  `allow_file_upload` tinyint(1) NOT NULL default '0',
  `allow_signature` tinyint(1) NOT NULL default '0',
  `allow_url` tinyint(1) NOT NULL default '1',
  `news_sec_code` tinyint(1) NOT NULL default '1',
  `allow_image` tinyint(1) NOT NULL default '0',
  `max_signature` SMALLINT(6) NOT NULL default '0',
  `max_info` SMALLINT(6) NOT NULL default '0',
  `admin_addnews` tinyint(1) NOT NULL default '0',
  `admin_editnews` tinyint(1) NOT NULL default '0',
  `admin_comments` tinyint(1) NOT NULL default '0',
  `admin_categories` tinyint(1) NOT NULL default '0',
  `admin_editusers` tinyint(1) NOT NULL default '0',
  `admin_wordfilter` tinyint(1) NOT NULL default '0',
  `admin_xfields` tinyint(1) NOT NULL default '0',
  `admin_userfields` tinyint(1) NOT NULL default '0',
  `admin_static` tinyint(1) NOT NULL default '0',
  `admin_editvote` tinyint(1) NOT NULL default '0',
  `admin_newsletter` tinyint(1) NOT NULL default '0',
  `admin_blockip` tinyint(1) NOT NULL default '0',
  `admin_banners` tinyint(1) NOT NULL default '0',
  `admin_rss` tinyint(1) NOT NULL default '0',
  `admin_iptools` tinyint(1) NOT NULL default '0',
  `admin_rssinform` tinyint(1) NOT NULL default '0',
  `admin_googlemap` tinyint(1) NOT NULL default '0',
  `allow_html` tinyint(1) NOT NULL default '1',
  `group_prefix` text NOT NULL,
  `group_suffix` text NOT NULL,
  `allow_subscribe` tinyint(1) NOT NULL default '0',
  `allow_image_size` tinyint(1) NOT NULL default '0',
  `cat_allow_addnews` text NOT NULL,
  `flood_news` smallint(6) NOT NULL default '0',
  `max_day_news` smallint(6) NOT NULL default '0',
  `force_leech` tinyint(1) NOT NULL default '0',
  `edit_limit` smallint(6) NOT NULL default '0',
  `captcha_pm` tinyint(1) NOT NULL default '0',
  `max_pm_day` smallint(6) NOT NULL default '0',
  `max_mail_day` smallint(6) NOT NULL default '0',
  `admin_tagscloud` tinyint(1) NOT NULL default '0',
  `allow_vote` tinyint(1) NOT NULL default '0',
  `admin_complaint` tinyint(1) NOT NULL default '0',
  `news_question` tinyint(1) NOT NULL default '0',
  `comments_question` tinyint(1) NOT NULL default '0',
  `max_comment_day` smallint(6) NOT NULL default '0',
  `max_images` smallint(6) NOT NULL default '0',
  `max_files` smallint(6) NOT NULL default '0',
  `disable_news_captcha` smallint(6) NOT NULL default '0',
  `disable_comments_captcha` smallint(6) NOT NULL default '0',
  `pm_question` tinyint(1) NOT NULL default '0',
  `captcha_feedback` tinyint(1) NOT NULL default '1',
  `feedback_question` tinyint(1) NOT NULL default '0',
  `files_type` varchar(255) NOT NULL default '',
  `max_file_size` mediumint(9) NOT NULL default '0',
  `files_max_speed` smallint(6) NOT NULL default '0',
  `allow_lostpassword` tinyint(1) NOT NULL default '1',
  `spamfilter` tinyint(1) NOT NULL default '2',
  `allow_comments_rating` tinyint(1) NOT NULL default '1',
  `max_edit_days` tinyint(1) NOT NULL default '0',
  `spampmfilter` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_poll";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_poll (
  `id` mediumint(8) unsigned NOT NULL auto_increment,
  `news_id` int(10) unsigned NOT NULL default '0',
  `title` varchar(200) NOT NULL default '',
  `frage` varchar(200) NOT NULL default '',
  `body` text NOT NULL,
  `votes` mediumint(8) NOT NULL default '0',
  `multiple` tinyint(1) NOT NULL default '0',
  `answer` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `news_id` (`news_id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_poll_log";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_poll_log (
  `id` int(10) unsigned NOT NULL auto_increment,
  `news_id` int(10) unsigned NOT NULL default '0',
  `member` varchar(40) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `news_id` (`news_id`,`member`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_banners";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_banners (
  `id` smallint(5) NOT NULL auto_increment,
  `banner_tag` varchar(40) NOT NULL default '',
  `descr` varchar(200) NOT NULL default '',
  `code` text NOT NULL,
  `approve` tinyint(1) NOT NULL default '0',
  `short_place` tinyint(1) NOT NULL default '0',
  `bstick` tinyint(1) NOT NULL default '0',
  `main` tinyint(1) NOT NULL default '0',
  `category` VARCHAR(255) NOT NULL default '',
  `grouplevel` varchar(100) NOT NULL default 'all',
  `start` varchar(15) NOT NULL default '',
  `end` varchar(15) NOT NULL default '',
  `fpage` tinyint(1) NOT NULL default '0',
  `innews` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_rss";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_rss (
  `id` smallint(5) NOT NULL auto_increment,
  `url` varchar(255) NOT NULL default '',
  `description` text NOT NULL,
  `allow_main` tinyint(1) NOT NULL default '0',
  `allow_rating` tinyint(1) NOT NULL default '0',
  `allow_comm` tinyint(1) NOT NULL default '0',
  `text_type` tinyint(1) NOT NULL default '0',
  `date` tinyint(1) NOT NULL default '0',
  `search` text NOT NULL,
  `max_news` tinyint(3) NOT NULL default '0',
  `cookie` text NOT NULL,
  `category` smallint(5) NOT NULL default '0',
  `lastdate` INT(11) unsigned NOT NULL default '0',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_views";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_views (
  `id` int(11) NOT NULL auto_increment,
  `news_id` int(11) NOT NULL default '0',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";


$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_rssinform";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_rssinform (
  `id` smallint(5) NOT NULL auto_increment,
  `tag` varchar(40) NOT NULL default '',
  `descr` varchar(255) NOT NULL default '',
  `category` varchar(200) NOT NULL default '',
  `url` varchar(255) NOT NULL default '',
  `template` varchar(40) NOT NULL default '',
  `news_max` smallint(5) NOT NULL default '0',
  `tmax` smallint(5) NOT NULL default '0',
  `dmax` smallint(5) NOT NULL default '0',
  `approve` tinyint(1) NOT NULL default '1',
  `rss_date_format` VARCHAR(20) NOT NULL default '',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_notice";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_notice (
  `id` mediumint(8) NOT NULL auto_increment,
  `user_id` mediumint(8) NOT NULL default '0',
  `notice` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `user_id` (`user_id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_static_files";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_static_files (
  `id` mediumint(8) NOT NULL AUTO_INCREMENT,
  `static_id` mediumint(8) NOT NULL default '0',
  `author` varchar(40) NOT NULL default '',
  `date` varchar(50) NOT NULL default '',
  `name` varchar(255) NOT NULL default '',
  `onserver` varchar(255) NOT NULL default '',
  `dcount` mediumint(8) NOT NULL default '0',
  PRIMARY KEY (`id`),
  KEY `static_id` (`static_id`),
  KEY `onserver` (`onserver`),
  KEY `author` (`author`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_static_files` CHANGE `onserver` `onserver` VARCHAR(250) NOT NULL DEFAULT ''";


$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_tags";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_tags (
  `id` INT(11) NOT NULL auto_increment,
  `news_id` INT(11) NOT NULL default '0',
  `tag` varchar(100) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `news_id` (`news_id`),
  KEY `tag` (`tag`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_post_log";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_post_log (
  `id` INT(11) NOT NULL auto_increment,
  `news_id` INT(11) NOT NULL default '0',
  `expires` varchar(15) NOT NULL default '',
  `action` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `news_id` (`news_id`),
  KEY `expires` (`expires`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_admin_sections";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_admin_sections (
  `id` mediumint(8) NOT NULL auto_increment,
  `name` varchar(100) NOT NULL default '',
  `title` varchar(255) NOT NULL default '',
  `descr` varchar(255) NOT NULL default '',
  `icon` varchar(255) NOT NULL default '',
  `allow_groups` varchar(255) NOT NULL default '',
  PRIMARY KEY  (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_admin_sections` CHANGE `name` `name` VARCHAR(100) NOT NULL DEFAULT ''";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_subscribe";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_subscribe (
  `id` int(11) NOT NULL auto_increment,
  `user_id` int(11) NOT NULL default '0',
  `name` varchar(40) NOT NULL default '',
  `email`  varchar(50) NOT NULL default '',
  `news_id` int(11) NOT NULL default '0',
  `hash` varchar(32) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `news_id` (`news_id`),
  KEY `user_id` (`user_id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_sendlog";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_sendlog (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user` varchar(40) NOT NULL DEFAULT '',
  `date` INT(11) unsigned NOT NULL DEFAULT '0',
  `flag` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `user` (`user`),
  KEY `date` (`date`),
  KEY `flag` (`flag`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_login_log";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_login_log (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `ip` varchar(40) NOT NULL DEFAULT '',
  `count` smallint(6) NOT NULL DEFAULT '0',
  `date` int(11) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `ip` (`ip`),
  KEY `date` (`date`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_mail_log";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_mail_log (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL DEFAULT '0',
  `mail` varchar(50) NOT NULL DEFAULT '',
  `hash` varchar(40) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`),
  KEY `hash` (`hash`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_complaint";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_complaint (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `p_id` int(11) NOT NULL DEFAULT '0',
  `c_id` int(11) NOT NULL DEFAULT '0',
  `n_id` int(11) NOT NULL DEFAULT '0',
  `text` text NOT NULL,
  `from` varchar(40) NOT NULL DEFAULT '',
  `to` varchar(255) NOT NULL DEFAULT '',
  `date` int(11) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `c_id` (`c_id`),
  KEY `p_id` (`p_id`),
  KEY `n_id` (`n_id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_ignore_list";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_ignore_list (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `user` int(11) NOT NULL default '0',
  `user_from` VARCHAR(40) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `user` (`user`),
  KEY `user_from` (`user_from`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_admin_logs";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_admin_logs (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(40) NOT NULL DEFAULT '',
  `date` int(11) unsigned NOT NULL DEFAULT '0',
  `ip` varchar(40) NOT NULL DEFAULT '',
  `action` int(11) NOT NULL DEFAULT '0',
  `extras` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `date` (`date`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_question";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_question (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `question` varchar(255) NOT NULL DEFAULT '',
  `answer` text NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_read_log";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_read_log (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `news_id` int(11) NOT NULL DEFAULT '0',
  `ip` varchar(40) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`),
  KEY `news_id` (`news_id`),
  KEY `ip` (`ip`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_spam_log";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_spam_log (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `ip` varchar(40) NOT NULL DEFAULT '',
  `is_spammer` tinyint(1) NOT NULL DEFAULT '0',
  `email` varchar(50) NOT NULL DEFAULT '',
  `date` int(11) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `ip` (`ip`),
  KEY `is_spammer` (`is_spammer`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_links";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_links (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `word` varchar(255) NOT NULL DEFAULT '',
  `link` varchar(255) NOT NULL DEFAULT '',
  `only_one` tinyint(1) NOT NULL DEFAULT '0',
  `replacearea` tinyint(1) NOT NULL DEFAULT '1',
  `rcount` tinyint(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_links` ADD `targetblank` TINYINT(1) NOT NULL DEFAULT '0'";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_social_login";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_social_login (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sid` varchar(40) NOT NULL DEFAULT '',
  `uid` int(11) NOT NULL DEFAULT '0',
  `password` varchar(32) NOT NULL DEFAULT '',
  `provider` varchar(15) NOT NULL DEFAULT '',
  `wait` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `sid` (`sid`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_social_login` ADD `waitlogin` TINYINT(1) NOT NULL DEFAULT '0'";

$tableSchema[] = "DROP TABLE IF EXISTS " . PREFIX . "_comment_rating_log";
$tableSchema[] = "CREATE TABLE " . PREFIX . "_comment_rating_log (
  `id` int unsigned NOT NULL auto_increment,
  `c_id` int NOT NULL default '0',
  `member` varchar(40) NOT NULL default '',
  `ip` varchar(40) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `c_id` (`c_id`),
  KEY `member` (`member`),
  KEY `ip` (`ip`)
  ) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_comment_rating_log` ADD `rating` TINYINT(4) NOT NULL DEFAULT '0'";

////////////////// ОПРЕДЕЛЯЮЩИЕ СБОРКИ /////////////////////////////

require_once(ROOT_DIR.'/install/sborka_key_e1.php');

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_datting_meeting`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_datting_meeting` (
  `event_id` int(11) NOT NULL AUTO_INCREMENT,
  `subject` text NOT NULL DEFAULT '',
  `detail` text NOT NULL DEFAULT '',
  `event_date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `event_recur` tinyint(1) NOT NULL DEFAULT '0',
  `queue_flag` tinyint(4) NOT NULL DEFAULT '0',
  `club` varchar(255) NOT NULL DEFAULT '',
  `dj_name` text NOT NULL DEFAULT '',
  `style_music` text NOT NULL DEFAULT '',
  `field0` text NOT NULL DEFAULT '',
  `user` varchar(255) NOT NULL DEFAULT '',
  `user_club` varchar(255) NOT NULL DEFAULT '',
  `approve` varchar(255) NOT NULL DEFAULT '',
  `gold` varchar(255) NOT NULL DEFAULT '',
  `rate` int(11) NOT NULL DEFAULT '0',
  `price` varchar(255) NOT NULL DEFAULT '',
  `zhanr` varchar(255) NOT NULL DEFAULT '',
  `rezh` varchar(255) NOT NULL DEFAULT '',
  `vrolax` varchar(255) NOT NULL DEFAULT '',
  `zhan` varchar(255) NOT NULL DEFAULT '',
  `zhan_c` varchar(255) NOT NULL DEFAULT '',
  `birthdate` varchar(254) NOT NULL DEFAULT '',
  `city` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`event_id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_datting_meeting_in`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_datting_meeting_in` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `tag` varchar(255) NOT NULL DEFAULT '',
  `post` int(3) DEFAULT '1',
  `translit` varchar(255) CHARACTER SET cp1251 DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_datting_photo_com`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_datting_photo_com` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `subj` varchar(255) NOT NULL DEFAULT '',
  `text` text NOT NULL DEFAULT '',
  `user` mediumint(8) NOT NULL DEFAULT '0',
  `user_from` varchar(50) NOT NULL DEFAULT '',
  `date` varchar(15) NOT NULL DEFAULT '',
  `pm_read` char(3) NOT NULL DEFAULT '',
  `folder` varchar(10) NOT NULL DEFAULT '',
  `reply` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`),
  KEY `folder` (`folder`),
  KEY `user` (`user`),
  KEY `user_from` (`user_from`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_datting_photo_profile`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_datting_photo_profile` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` tinytext NOT NULL DEFAULT '',
  `user` tinytext NOT NULL DEFAULT '',
  `user_id` tinytext NOT NULL DEFAULT '',
  `rate` tinytext NOT NULL DEFAULT '',
  `allow_rate` int(11) DEFAULT '0',
  `sum_comm` tinytext NOT NULL DEFAULT '',
  `approve` tinytext NOT NULL DEFAULT '',
  `com_admin` tinytext NOT NULL DEFAULT '',
  `vote_sum` int(10) NOT NULL DEFAULT '0',
  `intim` int(11) DEFAULT '0',
  `lid` int(11) DEFAULT '0',
  `image` tinytext NOT NULL DEFAULT '',
  `reg_date` date NOT NULL DEFAULT '0000-00-00',
  `text` text NOT NULL DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_users_napr`";
$tableSchema[] = "CREATE TABLE `".PREFIX."_users_napr` (
  `id` int(4) NOT NULL auto_increment,
  `name` varchar(255) NOT NULL default '',
  `descr` text NOT NULL,
  `value` varchar(255) NOT NULL default '',
  `col` int(20) NOT NULL default '0',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_users_testidealpari`";
$tableSchema[] = "CREATE TABLE `".PREFIX."_users_testidealpari` (
  `id` int(5) NOT NULL auto_increment,
  `vote_id` int(8) NOT NULL default '0',
  `user_name` varchar(255) NOT NULL default '',
  `user_id` varchar(255) NOT NULL default '',
  `vibral` varchar(255) NOT NULL default '',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_users_testpartnerov`";
$tableSchema[] = "CREATE TABLE `".PREFIX."_users_testpartnerov` (
  `id` int(5) NOT NULL auto_increment,
  `vote_id` int(5) NOT NULL default '0',
  `otvet_ball` varchar(255) NOT NULL default '',
  `user_id` varchar(255) NOT NULL default '',
  `user_name` varchar(255) NOT NULL default '',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_market_category`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_market_category` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `type` char(255) CHARACTER SET utf8 NOT NULL,
  `options` text CHARACTER SET utf8 NOT NULL,
  `sort` smallint(8) NOT NULL DEFAULT '1',
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "INSERT INTO `".PREFIX."_market_category` (`id`, `type`, `options`, `sort`) VALUES
(330, 'currency', 'name=Рубли|||symbol=руб', 1),
(328, 'category', 'name=Кондиционеры|||alt_name=kondicionery|||template=|||icon=|||description=Кондиционеры|||opisanie=|||keywords=|||cat=324', 1),
(329, 'category', 'name=Холодильники|||alt_name=holodilniki|||template=|||icon=|||description=Холодильники|||opisanie=|||keywords=|||cat=324|||count_post=', 1),
(326, 'category', 'name=СВЧ-печи|||alt_name=svch-pechi|||template=|||icon=|||description=СВЧ-печи|||opisanie=|||keywords=|||cat=324', 1),
(327, 'category', 'name=Обогреватели|||alt_name=obogrevateli|||template=|||icon=|||description=Обогреватели|||opisanie=|||keywords=|||cat=324', 1),
(324, 'category', 'name=Бытовая техника|||alt_name=bytovaya-tehnika|||template=|||icon=|||description=Бытовая техника|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(325, 'category', 'name=Стиральные машины|||alt_name=stiralnye-mashiny|||template=|||icon=|||description=Стиральные машины|||opisanie=|||keywords=|||cat=324', 1),
(322, 'category', 'name=Видеокамеры|||alt_name=videokamery|||template=|||icon=|||description=Видеокамеры ыыы|||opisanie=|||keywords=|||cat=317|||count_post=', 1),
(323, 'category', 'name=Фотоаппараты|||alt_name=fotoapparaty|||template=|||icon=|||description=Фотоаппараты|||opisanie=|||keywords=|||cat=317', 1),
(320, 'category', 'name=Телевизоры|||alt_name=televizory|||template=|||icon=|||description=Телевизоры|||opisanie=|||keywords=|||cat=317', 1),
(321, 'category', 'name=DVD-плееры|||alt_name=dvd-pleery|||template=|||icon=|||description=DVD-плееры|||opisanie=|||keywords=|||cat=317', 1),
(318, 'category', 'name=GPS-навигаторы|||alt_name=gps-navigatory|||template=|||icon=|||description=GPS-навигаторы|||opisanie=|||keywords=|||cat=317', 1),
(319, 'category', 'name=MP3-плееры|||alt_name=mp3-pleery|||template=|||icon=|||description=MP3-плееры|||opisanie=|||keywords=|||cat=317|||count_post=', 1),
(315, 'category', 'name=Гарнитуры|||alt_name=garnitury|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=313', 1),
(316, 'category', 'name=Сотовые телефоны|||alt_name=sotovye-telefony|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=313', 1),
(317, 'category', 'name=Электроника|||alt_name=elektronika|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(294, 'category', 'name=Продукты, напитки, табак|||alt_name=produkty-napitki-tabak|||template=|||icon=|||description=Товары в маркете товаров|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(295, 'category', 'name=Чай, кофе, какао|||alt_name=chay-kofe-kakao|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294|||count_post=', 1),
(296, 'category', 'name=Консервированные продукты|||alt_name=konservirovannye-produkty|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(297, 'category', 'name=Фрукты и овощи|||alt_name=frukty-i-ovoschi|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(298, 'category', 'name=Кондитерские изделия|||alt_name=konditerskie-izdeliya|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(299, 'category', 'name=Табачные изделия|||alt_name=tabachnye-izdeliya|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(300, 'category', 'name=Еда быстрого приготовления|||alt_name=eda-bystrogo-prigotovleniya|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(301, 'category', 'name=Спортивное питание|||alt_name=sportivnoe-pitanie|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(302, 'category', 'name=Диетическое и лечебное питание|||alt_name=dieticheskoe-i-lechebnoe-pitanie|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(303, 'category', 'name=Соусы, специи|||alt_name=sousy-specii|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(304, 'category', 'name=Детское питание|||alt_name=detskoe-pitanie|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(305, 'category', 'name=Пиво и сухой солод|||alt_name=pivo-i-suhoy-solod|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(306, 'category', 'name=Безалкогольные напитки|||alt_name=bezalkogolnye-napitki|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(307, 'category', 'name=Молочные продукты|||alt_name=molochnye-produkty|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(308, 'category', 'name=Бакалея|||alt_name=bakaleya|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=294', 1),
(309, 'category', 'name=Авто|||alt_name=avto|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(310, 'category', 'name=Магнитолы|||alt_name=magnitoly|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=309|||count_post=', 1),
(311, 'category', 'name=Диски|||alt_name=diski|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=309', 1),
(312, 'category', 'name=Шины|||alt_name=shiny|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=309', 1),
(313, 'category', 'name=Телефоны|||alt_name=telefony|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=0', 1),
(314, 'category', 'name=Радиотелефоны|||alt_name=radiotelefony|||template=|||icon=|||description=|||opisanie=|||keywords=|||cat=313', 1)";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_market_comments`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_market_comments` (
  `id` mediumint(8) NOT NULL,
  `author` char(40) NOT NULL,
  `author_id` mediumint(8) NOT NULL,
  `email` char(255) NOT NULL,
  `text` text NOT NULL,
  `date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `board_id` mediumint(8) NOT NULL,
  `del` tinyint(1) NOT NULL DEFAULT '0',
  `ip` char(255) NOT NULL,
  `answer` mediumint(10) NOT NULL DEFAULT '0',
  `approve` tinyint(4) NOT NULL,
  `otz` text NOT NULL
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_market_list`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_market_list` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` char(255) NOT NULL,
  `alt_name` char(255) NOT NULL,
  `text` text NOT NULL,
  `author` varchar(255) NOT NULL,
  `author_id` mediumint(8) NOT NULL,
  `date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `end_date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `comm_num` smallint(10) NOT NULL DEFAULT '0',
  `price` int(10) NOT NULL DEFAULT '0',
  `currency` int(10) NOT NULL,
  `board_type` int(10) NOT NULL,
  `country` int(10) NOT NULL,
  `city` int(10) NOT NULL,
  `category` int(10) NOT NULL,
  `allow_comm` tinyint(1) NOT NULL DEFAULT '0',
  `xfields` text NOT NULL,
  `fio` char(255) NOT NULL,
  `phone` char(255) NOT NULL,
  `email` char(255) NOT NULL,
  `http` char(255) NOT NULL,
  `photos` text NOT NULL,
  `views` mediumint(8) NOT NULL DEFAULT '0',
  `vip_date` int(11) NOT NULL,
  `super_vip_date` int(11) NOT NULL,
  `color` char(255) NOT NULL,
  `color_date` int(11) NOT NULL,
  `no_del` tinyint(1) NOT NULL DEFAULT '1',
  `approve` tinyint(1) NOT NULL DEFAULT '0',
  `rp` varchar(255) NOT NULL DEFAULT '0',
  `rm` varchar(255) NOT NULL DEFAULT '0',
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_market_photo`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_market_photo` (
  `id` int(3) NOT NULL AUTO_INCREMENT,
  `id_obj` int(7) NOT NULL DEFAULT '0',
  `image` varchar(255) NOT NULL DEFAULT '',
  `item` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_market_ratings`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_market_ratings` (
  `id` mediumint(9) NOT NULL,
  `user` varchar(255) NOT NULL,
  `time` varchar(255) NOT NULL,
  `act` varchar(111) NOT NULL,
  `board_id` varchar(255) NOT NULL
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_photoreportage`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_photoreportage` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `type` int(10) NOT NULL,
  `cat` int(10) NOT NULL,
  `col_photo` int(10) DEFAULT NULL,
  `date` date NOT NULL,
  `event` int(15) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_photoreportage_photos`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_photoreportage_photos` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `url_name` text NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `authors` varchar(255) NOT NULL,
  `reportage_id` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_pharmacy_category`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_pharmacy_category` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `type` char(255) CHARACTER SET utf8 NOT NULL,
  `options` text CHARACTER SET utf8 NOT NULL,
  `sort` smallint(8) NOT NULL DEFAULT '1',
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "INSERT INTO `".PREFIX."_pharmacy_category` (`id`, `type`, `options`, `sort`) VALUES
(330, 'currency', 'name=Рубли|||symbol=руб', 1),
(345, 'category', 'name=Гигиена женщины|||alt_name=gigiena-zhenschiny|||template=|||icon=129.jpg|||description=Гигиена женщины. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(344, 'category', 'name=Самоконтроль здоровья|||alt_name=samokontrol-zdorovya|||template=|||icon=128.jpg|||description=Самоконтроль здоровья. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(343, 'category', 'name=Красота и здоровье|||alt_name=krasota-i-zdorove|||template=|||icon=127.jpg|||description=Красота и здоровье. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(342, 'category', 'name=Уютный дом|||alt_name=uyutnyy-dom|||template=|||icon=126.jpg|||description=Уютный дом. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(341, 'category', 'name=Аптечная косметика|||alt_name=aptechnaya-kosmetika|||template=|||icon=125.jpg|||description=Аптечная косметика. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(340, 'category', 'name=Интимные товары|||alt_name=intimnye-tovary|||template=|||icon=124.jpg|||description=Интимные товары. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(333, 'category', 'name=Биологически активные добавки|||alt_name=biologicheski-aktivnye-dobavki|||template=|||icon=117.jpg|||description=Биологически активные добавки. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(332, 'category', 'name=Все для мамы|||alt_name=vse-dlya-mamy|||template=|||icon=116.jpg|||description=Все для мамы. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(339, 'category', 'name=Уход за больными|||alt_name=uhod-za-bolnymi|||template=|||icon=123.jpg|||description=Уход за больными. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(338, 'category', 'name=Товары для животных|||alt_name=tovary-dlya-zhivotnyh|||template=|||icon=122.jpg|||description=Товары для животных. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(337, 'category', 'name=Медицинская техника|||alt_name=medicinskaya-tehnika|||template=|||icon=121.jpg|||description=Медицинская техника. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(336, 'category', 'name=Здоровое питание|||alt_name=zdorovoe-pitanie|||template=|||icon=120.jpg|||description=Здоровое питание. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(335, 'category', 'name=Товары медицинского назначения|||alt_name=tovary-medicinskogo-naznacheniya|||template=|||icon=119.jpg|||description=Товары медицинского назначения. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0', 1),
(334, 'category', 'name=Детские товары|||alt_name=detskie-tovary|||template=|||icon=118.jpg|||description=Детские товары. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(331, 'category', 'name=Лекарственные средства|||alt_name=lekarstvennye-sredstva|||template=|||icon=115.jpg|||description=Лекарственные средства. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(346, 'category', 'name=Репелленты|||alt_name=repellenty|||template=|||icon=|||description=Репелленты. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=342|||count_post=', 1),
(347, 'category', 'name=Презервативы|||alt_name=prezervativy|||template=|||icon=|||description=Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=340', 1),
(348, 'category', 'name=Лечебные средства|||alt_name=lechebnye-sredstva|||template=|||icon=|||description=Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=338|||count_post=', 1),
(349, 'category', 'name=Принадлежности|||alt_name=prinadlezhnosti|||template=|||icon=|||description=Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=338', 1),
(350, 'category', 'name=Все для кормления ребенка|||alt_name=vse-dlya-kormleniya-rebenka|||template=|||icon=|||description=Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=334', 1),
(351, 'category', 'name=Все для купания малыша|||alt_name=vse-dlya-kupaniya-malysha|||template=|||icon=|||description=Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=334', 1),
(352, 'category', 'name=Все для самых маленьких|||alt_name=vse-dlya-samyh-malenkih|||template=|||icon=|||description=Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=334|||count_post=', 1),
(353, 'category', 'name=Детская косметика|||alt_name=detskaya-kosmetika|||template=|||icon=|||description=Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=334', 1)";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_pharmacy_comments`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_pharmacy_comments` (
  `id` mediumint(8) NOT NULL,
  `author` char(40) NOT NULL,
  `author_id` mediumint(8) NOT NULL,
  `email` char(255) NOT NULL,
  `text` text NOT NULL,
  `date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `board_id` mediumint(8) NOT NULL,
  `del` tinyint(1) NOT NULL DEFAULT '0',
  `ip` char(255) NOT NULL,
  `answer` mediumint(10) NOT NULL DEFAULT '0',
  `approve` tinyint(4) NOT NULL,
  `otz` text NOT NULL
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";


$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_pharmacy_list`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_pharmacy_list` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` char(255) NOT NULL,
  `alt_name` char(255) NOT NULL,
  `text` text NOT NULL,
  `author` varchar(255) NOT NULL,
  `author_id` mediumint(8) NOT NULL,
  `date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `end_date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `comm_num` smallint(10) NOT NULL DEFAULT '0',
  `price` int(10) NOT NULL DEFAULT '0',
  `currency` int(10) NOT NULL,
  `board_type` int(10) NOT NULL,
  `country` int(10) NOT NULL,
  `city` int(10) NOT NULL,
  `category` int(10) NOT NULL,
  `allow_comm` tinyint(1) NOT NULL DEFAULT '0',
  `xfields` text NOT NULL,
  `fio` char(255) NOT NULL,
  `phone` char(255) NOT NULL,
  `email` char(255) NOT NULL,
  `http` char(255) NOT NULL,
  `photos` text NOT NULL,
  `views` mediumint(8) NOT NULL DEFAULT '0',
  `vip_date` int(11) NOT NULL,
  `super_vip_date` int(11) NOT NULL,
  `color` char(255) NOT NULL,
  `color_date` int(11) NOT NULL,
  `no_del` tinyint(1) NOT NULL DEFAULT '1',
  `approve` tinyint(1) NOT NULL DEFAULT '0',
  `rp` varchar(255) NOT NULL DEFAULT '0',
  `rm` varchar(255) NOT NULL DEFAULT '0',
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_pharmacy_photo`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_pharmacy_photo` (
  `id` int(3) NOT NULL AUTO_INCREMENT,
  `id_obj` int(7) NOT NULL DEFAULT '0',
  `image` varchar(255) NOT NULL DEFAULT '',
  `item` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";


$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_pharmacy_ratings`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_pharmacy_ratings` (
  `id` mediumint(9) NOT NULL,
  `user` varchar(255) NOT NULL,
  `time` varchar(255) NOT NULL,
  `act` varchar(111) NOT NULL,
  `board_id` varchar(255) NOT NULL
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_skidki_category`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_skidki_category` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `type` char(255) CHARACTER SET utf8 NOT NULL,
  `options` text CHARACTER SET utf8 NOT NULL,
  `sort` smallint(8) NOT NULL DEFAULT '1',
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "INSERT INTO `".PREFIX."_skidki_category` (`id`, `type`, `options`, `sort`) VALUES
(297, 'category', 'name=Бытовая техника|||alt_name=bytovaya-tehnika|||template=|||icon=|||description=Бытовая техника. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=0|||count_post=', 1),
(298, 'category', 'name=Холодильники|||alt_name=holodilniki|||template=|||icon=|||description=Холодильники. Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=297|||count_post=', 1),
(299, 'category', 'name=Кондиционеры|||alt_name=kondicionery|||template=|||icon=|||description=Кондиционеры Телефоны, режим работы, рейтинги, отзывы пользователей. Актуальная, проверенная информация.|||opisanie=|||keywords=|||cat=297|||count_post=', 1)";

$tableSchema[] = "DROP TABLE IF EXISTS `ucl_skidki_comments`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_skidki_comments` (
  `id` mediumint(8) NOT NULL,
  `author` char(40) NOT NULL,
  `author_id` mediumint(8) NOT NULL,
  `email` char(255) NOT NULL,
  `text` text NOT NULL,
  `date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `board_id` mediumint(8) NOT NULL,
  `del` tinyint(1) NOT NULL DEFAULT '0',
  `ip` char(255) NOT NULL,
  `answer` mediumint(10) NOT NULL DEFAULT '0',
  `approve` tinyint(4) NOT NULL,
  `otz` text NOT NULL
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_skidki_list`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_skidki_list` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` char(255) NOT NULL,
  `alt_name` char(255) NOT NULL,
  `text` text NOT NULL,
  `author` varchar(255) NOT NULL,
  `author_id` mediumint(8) NOT NULL,
  `date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `end_date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `comm_num` smallint(10) NOT NULL DEFAULT '0',
  `price` int(10) NOT NULL DEFAULT '0',
  `currency` int(10) NOT NULL,
  `board_type` int(10) NOT NULL,
  `country` int(10) NOT NULL,
  `city` int(10) NOT NULL,
  `category` int(10) NOT NULL,
  `allow_comm` tinyint(1) NOT NULL DEFAULT '0',
  `xfields` text NOT NULL,
  `fio` char(255) NOT NULL,
  `phone` char(255) NOT NULL,
  `email` char(255) NOT NULL,
  `http` char(255) NOT NULL,
  `photos` text NOT NULL,
  `views` mediumint(8) NOT NULL DEFAULT '0',
  `vip_date` int(11) NOT NULL,
  `super_vip_date` int(11) NOT NULL,
  `color` char(255) NOT NULL,
  `color_date` int(11) NOT NULL,
  `no_del` tinyint(1) NOT NULL DEFAULT '1',
  `approve` tinyint(1) NOT NULL DEFAULT '0',
  `rp` varchar(255) NOT NULL DEFAULT '0',
  `rm` varchar(255) NOT NULL DEFAULT '0',
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_skidki_photo`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_skidki_photo` (
  `id` int(3) NOT NULL AUTO_INCREMENT,
  `id_obj` int(7) NOT NULL DEFAULT '0',
  `image` varchar(255) NOT NULL DEFAULT '',
  `item` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";


$tableSchema[] = "DROP TABLE IF EXISTS `".PREFIX."_skidki_ratings`";
$tableSchema[] = "CREATE TABLE IF NOT EXISTS `".PREFIX."_skidki_ratings` (
  `id` mediumint(9) NOT NULL,
  `user` varchar(255) NOT NULL,
  `time` varchar(255) NOT NULL,
  `act` varchar(111) NOT NULL,
  `board_id` varchar(255) NOT NULL
) ENGINE=MyISAM /*!40101 DEFAULT CHARACTER SET " . COLLATE . " COLLATE " . COLLATE . "_general_ci */";

////////////////////////////////////////////////////////////////////

$tableSchema[] = "ALTER TABLE  `".PREFIX."_comments` ADD  `fc` smallint(8) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_comments` CHANGE `ip` `ip` VARCHAR(40) NOT NULL DEFAULT ''";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_comments` ADD INDEX `rating` (`rating`)";

$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `subscription` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `forum_post` smallint(5) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `forum_warn` smallint(5) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `forum_update` varchar(20) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `forum_rank` varchar(40) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `com_email` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `com_club_email` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `view_my_page` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `com_my_page` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `view_my_friend` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `view_my_album` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `in_var` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `to_var` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `my_var` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `club_var` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `news_tid` smallint(5) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `allow_rate` int(5) NOT NULL default '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `vote_num` int(5) NOT NULL default '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `votes` int(5) NOT NULL default '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `flag` int(5) NOT NULL default '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `city` varchar(20) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `firm` int(11) NOT NULL default '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `objects` int(11) NOT NULL default '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_post` ADD  `address` text NOT NULL default ''";

$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `country` varchar(50) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `city` varchar(50) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `pm_notify` tinyint(1) NOT NULL DEFAULT '1'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `logged_proxy` varchar(15) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `useragent` varchar(100) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `forumposts` mediumint(9) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `location` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `top_comm` mediumint(8) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `cj` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `dj` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `style` varchar(245) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `yearstart` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `twsfa_albumvisit` varchar(20) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `twsfa_active` tinyint(1) NOT NULL DEFAULT '1'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `twsfa_albums` smallint(5) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `twsfa_picturies` mediumint(8) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `reply` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `com_all` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `com_unread` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `rate` smallint(5) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `sex` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `birthdate` date DEFAULT '0000-00-00'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `bdate_view` enum('0','1','2') NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `poster` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `invites_num` int(6) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `club` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `club_2` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `album` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `ishu` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `mob_phone` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `dom_phone` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `website` varchar(255) DEFAULT NULL";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `vkontakte` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `odnoklassniki` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `lj` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `webs` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `subscription` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `forum_post` smallint(5) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `forum_warn` smallint(5) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `forum_update` varchar(20) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `forum_rank` varchar(40) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `com_email` varchar(255) DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `com_club_email` varchar(255) DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `view_my_page` varchar(255) DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `com_my_page` varchar(255) DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `view_my_friend` varchar(255) DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `view_my_album` varchar(255) DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `in_var` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `to_var` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `my_var` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `club_var` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `krediti` float unsigned DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `lat` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `lng` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `datting` smallint(5) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `geteroopit` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `kakseks` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `vozbuzdaet` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `orientacia` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `narkotik` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `alkogol` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `kurenie` TEXT NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `zansportom` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `mater_podderzhka` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `svobodniyden` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `brak` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `znakomlus_s` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `znakomlus_voz_s` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `znakomlus_voz_po` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `rost` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `ves` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `kogoishu` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `cel_druzba` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `cartasponsor` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `fiosponsor` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `familiya` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `otchestvo` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `fiolat` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `addressst` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `typepasp` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `seripasp` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `nomerpasp` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `datavid` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `kemviden` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `ogrn` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `vipcard` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `vipcard2` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `kodpodr` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `kodslovo` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `vipcard3` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `vipcard4` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `vipcard5` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `vipcard6` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `fiolat2` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `valuta` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `typepasprnn` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `nomcard` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `polsex` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `vzgladi` varchar(255) NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_users` ADD  `modkino` varchar(255) NOT NULL default ''";

$tableSchema[] = "INSERT INTO " . PREFIX . "_rssinform VALUES (1, 'dle', 'Новости с Яндекса', '0', 'http://news.yandex.ru/index.rss', 'informer', 3, 0, 200, 1, 'j F Y H:i')";

$tableSchema[] = "INSERT INTO " . PREFIX . "_usergroups VALUES (1, 'Администраторы', 'all', 1, 'all', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 50, 101, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, '{THEME}/images/icon_1.gif', 0, 1, 1, 1, 1, 1, 1, 0, 1,500,1000,1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,1,'<b><span style=\"color:red\">','</span></b>',1,1,'all', 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 'zip,rar,exe,doc,pdf,swf', 4096, 0, 0, 2, 1, 0, 0)";
$tableSchema[] = "INSERT INTO " . PREFIX . "_usergroups VALUES (2, 'Главные редакторы', 'all', 1, 'all', 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 50, 101, 1, 1, 1, 0, 2, 1, 1, 1, 1, 1, 0, '{THEME}/images/icon_2.gif', 0, 1, 0, 1, 1, 1, 1, 0, 1,500,1000,1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,1,'','',1,1,'all', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 'zip,rar,exe,doc,pdf,swf', 4096, 0, 1, 2, 1, 0, 0)";
$tableSchema[] = "INSERT INTO " . PREFIX . "_usergroups VALUES (3, 'Журналисты', 'all', 1, 'all', 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 50, 101, 1, 1, 1, 0, 3, 0, 1, 1, 1, 1, 0, '{THEME}/images/icon_3.gif', 0, 1, 0, 1, 1, 1, 1, 0, 1,500,1000,1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,1,'','',1,1,'all', 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 'zip,rar,exe,doc,pdf,swf', 4096, 0, 1, 2, 1, 0, 0)";
$tableSchema[] = "INSERT INTO " . PREFIX . "_usergroups VALUES (4, 'Посетители', 'all', 1, 'all', 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 20, 101, 1, 1, 1, 0, 4, 0, 1, 1, 1, 1, 0, '{THEME}/images/icon_4.gif', 0, 1, 0, 1, 0, 1, 1, 1, 0,500,1000,0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,1,'','',1,0,'all', 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 'zip,rar,exe,doc,pdf,swf', 4096, 0, 1, 2, 1, 0, 2)";
$tableSchema[] = "INSERT INTO " . PREFIX . "_usergroups VALUES (5, 'Гости', 'all', 0, 'all', 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 5, 0, 1, 1, 1, 0, 1, '{THEME}/images/icon_5.gif', 0, 1, 0, 0, 0, 0, 1, 1, 0,1,1,0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,0,'','',0,0,'all', 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, '', 0, 0, 0, 2, 1, 0, 2)";

$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `forum_edit` tinyint(1) NOT NULL DEFAULT '1'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `forum_moderate` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `forum_admin` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `max_foto2` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_arcade` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_topsite` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_forum` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_referer` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_foto_conkurs` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_googlemaps` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_fotoalbum` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_editstrani` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_pay_edit_config` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_sms_edit_config` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_kartochka_edit_config` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_sms_hochu_obsh` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_sms_ocenki` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_sms_podarki` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_sms_obj` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_auto_catalog` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_pogoda_edit_config` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_pay` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_zhalobi` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_editafisha` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_addafisha` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_editclubizm` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_editnightclub` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_editnewsclub` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_editrating` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_awards` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_new_dob_clubi` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_new_dob_lclubi` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_new_com_clubam` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_new_com_clubs` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_new_com_music` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_new_com_afisha` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_new_com_photo` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_new_com_user` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_new_music_file` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_categories_music` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_categories_clubs` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_categories_clubss` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_editpay` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_editrate` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_invites` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_googlemaps_config` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_edit_video_config` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_spisok_school` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_spisok_vuzov` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_usergroups` ADD  `admin_tags` tinyint(1) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_reg` TINYINT(1) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_reg_days` MEDIUMINT(9) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_reg_group` SMALLINT(6) NOT NULL DEFAULT '4'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_news` TINYINT(1) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_news_count` MEDIUMINT(9) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_news_group` SMALLINT(6) NOT NULL DEFAULT '4'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_comments` TINYINT(1) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_comments_count` MEDIUMINT(9) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_comments_group` SMALLINT(6) NOT NULL DEFAULT '4'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_rating` TINYINT(1) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_rating_count` MEDIUMINT(9) NOT NULL DEFAULT '0'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `force_rating_group` SMALLINT(6) NOT NULL DEFAULT '4'";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `not_allow_cats` TEXT NOT NULL";

    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_usergroups` ADD `allow_up_image` TINYINT(1) NOT NULL DEFAULT '0' , ADD `allow_up_watermark` TINYINT(1) NOT NULL DEFAULT '0' , ADD `allow_up_thumb` TINYINT(1) NOT NULL DEFAULT '0' , ADD `up_count_image` SMALLINT NOT NULL DEFAULT '0' , ADD `up_image_side` VARCHAR(20) NOT NULL DEFAULT '' , ADD `up_image_size` MEDIUMINT(5) NOT NULL DEFAULT '0' , ADD `up_thumb_size` VARCHAR(20) NOT NULL DEFAULT ''";

$tableSchema[] = "INSERT INTO " . PREFIX . "_rss VALUES (1, 'http://dle-news.ru/rss.xml', 'Официальный сайт DataLife Engine', 1, 1, 1, 1, 1, '<td align=\"left\" valign=\"top\" class=\"news\">{get}<br /><br /></td>', 5, '', 1, 0)";

$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `rss` tinyint(1) NOT NULL DEFAULT '1'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `title` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `descr` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `allow_mod` char(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `allow_auto` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `allow_rate` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `allow_more` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `allow_watermark` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `date_format` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `load_img` varchar(20) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `thumb_img` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `start_template` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `delate` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `start` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `finish` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `inser` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `ful_start` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `start_title` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `end_title` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `start_short` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `end_short` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `sart_link` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `end_link` tinyint(1) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `sart_cat` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `cookies` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `keywords` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `stkeywords` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `Autors` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `xdescr` varchar(255) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `xpos` int(11) NOT NULL DEFAULT '0'";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `short_story` varchar(100) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `dop_nast` varchar(100) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `ctp` varchar(50) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `full_link` varchar(250) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `finish_template` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `dnast` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `symbol` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `ftags` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `metatitle` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `meta_descr` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `key_words` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `kategory` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `xfields_template` text NOT NULL default ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `dop_full` varchar(100) NOT NULL DEFAULT ''";
$tableSchema[] = "ALTER TABLE  `".PREFIX."_rss` ADD `add_city` varchar(255) NOT NULL DEFAULT ''";

$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) values (1, 'reg_mail', '{%username%},\r\n\r\nЭто письмо отправлено с сайта $url\r\n\r\nВы получили это письмо, так как этот e-mail адрес был использован при регистрации на сайте. Если Вы не регистрировались на этом сайте, просто проигнорируйте это письмо и удалите его. Вы больше не получите такого письма.\r\n\r\n------------------------------------------------\r\nВаш логин и пароль на сайте:\r\n------------------------------------------------\r\n\r\nЛогин: {%username%}\r\nПароль: {%password%}\r\n\r\n------------------------------------------------\r\nИнструкция по активации\r\n------------------------------------------------\r\n\r\nБлагодарим Вас за регистрацию.\r\nМы требуем от Вас подтверждения Вашей регистрации, для проверки того, что введённый Вами e-mail адрес - реальный. Это требуется для защиты от нежелательных злоупотреблений и спама.\r\n\r\nДля активации Вашего аккаунта, зайдите по следующей ссылке:\r\n\r\n{%validationlink%}\r\n\r\nЕсли и при этих действиях ничего не получилось, возможно Ваш аккаунт удалён. В этом случае, обратитесь к Администратору, для разрешения проблемы.\r\n\r\nС уважением,\r\n\r\nАдминистрация $url.')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) values (2, 'feed_mail', '{%username_to%},\r\n\r\nДанное письмо вам отправил {%username_from%} с сайта $url\r\n\r\n------------------------------------------------\r\nТекст сообщения\r\n------------------------------------------------\r\n\r\n{%text%}\r\n\r\nIP адрес отправителя: {%ip%}\r\n\r\n------------------------------------------------\r\nПомните, что администрация сайта не несет ответственности за содержание данного письма\r\n\r\nС уважением,\r\n\r\nАдминистрация $url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) values (3, 'lost_mail', 'Уважаемый {%username%},\r\n\r\nВы сделали запрос на получение забытого пароля на сайте $url Однако в целях безопасности все пароли хранятся в зашифрованном виде, поэтому мы не можем сообщить вам ваш старый пароль, поэтому если вы хотите сгенерировать новый пароль, зайдите по следующей ссылке: \r\n\r\n{%lostlink%}\r\n\r\nЕсли вы не делали запроса для получения пароля, то просто удалите данное письмо, ваш пароль храниться в надежном месте, и недоступен посторонним лицам.\r\n\r\nIP адрес отправителя: {%ip%}\r\n\r\nС уважением,\r\n\r\nАдминистрация $url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) values (4, 'new_news', 'Уважаемый администратор,\r\n\r\nуведомляем вас о том, что на сайт  $url была добавлена новость, которая в данный момент ожидает модерации.\r\n\r\n------------------------------------------------\r\nКраткая информация о новости\r\n------------------------------------------------\r\n\r\nАвтор: {%username%}\r\nЗаголовок новости: {%title%}\r\nКатегория: {%category%}\r\nДата добавления: {%date%}\r\n\r\nС уважением,\r\n\r\nАдминистрация $url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) values (5, 'comments', 'Уважаемый {%username_to%},\r\n\r\nуведомляем вас о том, что на сайт  $url был добавлен комментарий к новости, на которую вы были подписаны.\r\n\r\n------------------------------------------------\r\nКраткая информация о комментарии\r\n------------------------------------------------\r\n\r\nАвтор: {%username%}\r\nДата добавления: {%date%}\r\nСсылка на новость: {%link%}\r\n\r\n------------------------------------------------\r\nТекст комментария\r\n------------------------------------------------\r\n\r\n{%text%}\r\n\r\n------------------------------------------------\r\n\r\nЕсли вы не хотите больше получать уведомлений о новых комментариях к данной новости, то проследуйте по данной ссылке: {%unsubscribe%}\r\n\r\nС уважением,\r\n\r\nАдминистрация $url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) values (6, 'pm', 'Уважаемый {%username%},\r\n\r\nуведомляем вас о том, что на сайте  $url вам было отправлено персональное сообщение.\r\n\r\n------------------------------------------------\r\nКраткая информация о сообщении\r\n------------------------------------------------\r\n\r\nОтправитель: {%fromusername%}\r\nДата  получения: {%date%}\r\nЗаголовок: {%title%}\r\n\r\n------------------------------------------------\r\nТекст сообщения\r\n------------------------------------------------\r\n\r\n{%text%}\r\n\r\nС уважением,\r\n\r\nАдминистрация $url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) VALUES (7, 'new_pm', '{%to%},\r\n\r\n{%username%} {%sex%} Вам личное сообщение.\r\nПросмотреть Ваши новые личные сообщения можно на странице:\r\n".$url."index.php?do=pm\r\n\r\nС уважением,\r\nАдминистрация $url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) VALUES (8, 'new_cammen', 'Уведомляем вас о том,\r\nчто на сайте  ".$url." в клубе новый комментарий.\r\n------------------------------------------------\r\nПрочитать комментарий от {%username%}, можно тут: ".$url."clubizm/{%to%}\r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n$url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) VALUES (9, 'new_clubco', 'Уведомляем вас о том,\r\nчто на сайте  ".$url." в клубе \"{%to%}\" новый комментарий.\r\n------------------------------------------------\r\nПрочитать комментарий от {%username%}, можно на странице клуба: ".$url."clubizm/{%tourl%}\r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n$url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) VALUES (10, 'new_clubne', 'Уведомляем вас о том,\r\nчто на сайте  ".$url." в клубе {%to%} новая новость.\r\n------------------------------------------------\r\nПрочитать новость, можно на странице клуба: ".$url."clubizm/{%to%}. Или по прямому адресу новости: {%fullnews%}\r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n$url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) VALUES (11, 'new_comodn', 'Уведомляем вас о том,\r\nчто на сайте  ".$url." у пользователя {%to%} новый комментарий.\r\n------------------------------------------------\r\nПрочитать комментарий от {%username%}, можно на личной странице: ".$url."user/{%tourl%}. \r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n$url')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`) VALUES (12, 'new_comut', 'Уведомляем вас о том,\r\nчто на сайте  ".$url." был добавлен комментарий на вашу страницу.\r\n------------------------------------------------\r\nПрочитать комментарий от {%username%}, можно на вашей странице: ".$url."user/{%tourl%}.\r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n$url')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES (13, 'new_inform', 'Здравствуйте, {%username%}\r\n\r\nУведомляем вас о том,\r\nчто ваш запрос на создание информера для вашего сайта \"{%to%}\" был отправлен модератору проекта.\r\n------------------------------------------------\r\nПосле подтверждения модератором, вам будет выслан код для вставки на сайт и исходные коды для стилей в .css файле.\r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n$url')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES (14, 'app_inform', 'Уведомляем вас о том,\r\nчто ваш запрос на создание информера для вашего сайта {%to%} был принят.\r\n------------------------------------------------\r\nВаш код информера:\r\n{%code_informer%}\r\n\r\nСтили для вставки на сайт:\r\n{%style_informer%}\r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n$url')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(15, 'new_addobj', 'Уведомляем вас о том,\r\nчто на сайте  ".$url." в раздел ".$url."doska/{%to%}/ добавлено новое объявление {%title%}.\r\n------------------------------------------------\r\nПосмотреть объявление от {%username%}, можно на странице: ".$url."{%sub%}doska/obj/{%tourl%}/.\r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n$url')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(16, 'new_addaut', 'Уведомляем вас о том,\r\nчто на сайте  ".$url." в авто справочник на страницу ".$url."autocat/about_model/{%to%}/ добавлен новый комментарий.\r\n------------------------------------------------\r\nКомментарий от {%username%}\r\n\r\nТекст комментария: {%title%}\r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n$url')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(37, 'edazayavka', 'Уважаемый {%namer%},\r\n\r\nУведомляем вас о том, что была оставлена заявка на {%type%}.\r\n\r\n------------------------------------------------\r\nКраткая информация о комментарии\r\n------------------------------------------------\r\n\r\nКол-во людей: {%who%}\r\nСредний чек на человека: {%date%}\r\nПожелание по месту расположения (район): {%link%}\r\nПожелание по дате мероприятия: {}\r\nДополнительная информация: {}\r\nДополнительные пожелания: {}\r\n\r\n------------------------------------------------\r\nКонтактная информация\r\n------------------------------------------------\r\n\r\nФИО: {%text%}\r\nEmail: {}\r\nТелефон: {}\r\nICQ: {}\r\n\r\n------------------------------------------------\r\n\r\nС уважением,\r\n{%home_title%}')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(38, 'sendcart', 'Уважаемый {%namer%},\r\n\r\nУведомляем вас о том, что был оформлен заказ {%type%}.\r\n\r\n------------------------------------------------\r\nКраткая информация о комментарии\r\n------------------------------------------------\r\n\r\nЗаказанные товары: {%who%}\r\nОбщая стоимость: {%price%}\r\nДата заказа: {%date%}\r\n{%doppole%}\r\n\r\n------------------------------------------------\r\nКонтактная информация\r\n------------------------------------------------\r\n\r\nФИО: {%fio%}\r\nEmail: {%email%}\r\nТелефон: {%phone%}\r\nICQ: {%icq%}\r\n\r\n------------------------------------------------\r\n\r\nС уважением,\r\n{%home_title%}')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(39, 'reg_rating', 'Здравствуйте <b>{%url%}</b>,\r\n\r\nПозвольте поздравить Вас с успешной регистрацией в рейтинге сайтов - {%home_title%}. Информация о Вашем ресурсе:\r\n\r\n<b>Ваш уникальный номер [ID]: {%memberid%}\r\nИмя сайта : {%sitename%}\r\nАдрес сайта : {%url%}\r\nОписание сайта: {%description%}\r\n\r\nМы гордимся возможностью предоставить Вам профессиональный статистический сервис. Мы уверены, что наш сервис поможет Вам в развитии и продвижении Вашего проекта!\r\n\r\nДля дальнейшей работы Вам необходимо разместить на страницах ресурса специальный HTML-код. Код начнет собирать для вас статистику посещаемости вашего ресурса, а также обеспечит возможность участия в рейтинге.\r\n\r\nЧтобы получить код счетчика, воспользуйтесь этой ссылкой:\r\n{%http_home_url%}/rating/code/\r\n\r\nЕсли у вас возникли вопросы или предложения, обратитесь в {%http_home_url%}feedback/\r\nтехническую поддержку:\r\n\r\n\r\n--\r\n{%home_title%} | {%http_home_url%}')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(40, 'reg_ratins', 'Здравствуйте,\r\n\r\nВ топ был добавлен новый сайт:\r\nИнформация:\r\nУникальный номер [ID]: {%memberid%}\r\nИмя сайта : {%sitename%}\r\nEmail : {%email%}\r\nАдрес сайта : {%url%}\r\nОписание сайта : {%description%}\r\nПароль : {%pssw2%}\r\n\r\n--\r\n{%home_title%} | {%http_home_url%}')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(41, 'reg_st1', 'Статистика за прошедшие сутки:\r\n\r\nВаш ID: {%id%}\r\nХосты: {%host%}\r\nХиты: {%hits%}\r\nПользователи: {%users%}\r\n\r\nБолее подробную информацию Вы можете посмотреть {%http_home_url%}/my/ на странице статистики Вашего сайта\r\n\r\n--\r\n{%home_title%} | {%http_home_url%}')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(42, 'hotelzayav', 'Здравствуйте!\r\n\r\nПоступила заявка на бронирование номера:\r\nГостиница (квартира): {%se%}\r\nКонтактный телефон: {%contact_phone%}\r\nКонтактный email: {%contact_email%}\r\nФИО для контактов: {%contact_type%} {%contact_name%}\r\nГостей: {%dop_pole%}\r\nНомер: {%room_id%}\r\nКол-во номеров: {%room_count%}\r\nФорма оплаты: {%pay_type%}\r\nКол-во людей: {%guests_count%}\r\n\r\n--\r\n{%home_title%} | {%http_home_url%}')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(43, 'hotelzayas', 'Здравствуйте!\r\n\r\nВы направили заявку на бронирование номера:\r\nГостиница (квартира): {%se%}\r\nГостей: {%dop_pole%}\r\nНомер: {%room_id%}\r\nКол-во номеров: {%room_count%}\r\nФорма оплаты: {%pay_type%}\r\nКол-во людей: {%guests_count%}\r\n\r\nВ ближайшее время с вами свяжется менеджер данной гостиницы (квартиры) и уточнит детали бронирования.\r\n\r\n--\r\n{%home_title%} | {%http_home_url%}')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(44, 'videocom', 'Здравствуйте!\r\n\r\nУведомляем вас о том, что на сайте {%home_title%} в разделе видеозаписи появился новый комментарий.\r\n\r\nПрочитать комментарий можно на странице: {%http_home_url%}archiv_video/{%idvideo%}.html\r\n\r\nС Уважением,\r\nАдминистрация {%home_title%}')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_email` (`id`, `name`, `template`) VALUES(45, 'firm_com', 'Уведомляем вас о том,\r\nчто на сайте  {%http_home_url%} для организации \"{%to%}\" добавлен новый комментарий.\r\n------------------------------------------------\r\nПрочитать комментарий от {%username%}, можно на странице клуба: {%http_home_url%}firm/{%tourl%}\r\n------------------------------------------------\r\nС уважением,\r\nАдминистрация\r\n{%http_home_url%}')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`, `use_html`) values (17, 'wait_mail', 'Уважаемый {%username%},\r\n\r\nВы сделали запрос на обьединение  вашего аккаунта на сайте $url с аккаунтом в социальной сети {%network%}.  Однако в целях безопасности вам необходимо подтвердить данное действие по следующей ссылке: \r\n\r\n------------------------------------------------\r\n{%link%}\r\n------------------------------------------------\r\n\r\nВнимание, в случае объединения аккаунтов, ваш основной пароль на сайте будет сброшен, и если вы входили на сайт используя ваш логин и пароль, то ваш пароль будет больше не действителен.\r\n\r\nЕсли вы не делали данного запроса, то просто удалите это письмо, данные вашего аккаунта хранятся в надежном месте, и недоступны посторонним лицам.\r\n\r\nIP адрес отправителя: {%ip%}\r\n\r\nС уважением,\r\n\r\nАдминистрация $url', 0)";
$tableSchema[] = "INSERT INTO " . PREFIX . "_email (`id`, `name`, `template`, `use_html`) values (18, 'newsletter', '<html>\r\n<head>\r\n<title>{%title%}</title>\r\n<meta content=\"text/html; charset={%charset%}\" http-equiv=Content-Type>\r\n<style type=\"text/css\">\r\nhtml,body{\r\n    font-family: Verdana;\r\n    word-spacing: 0.1em;\r\n    letter-spacing: 0;\r\n    line-height: 1.5em;\r\n    font-size: 11px;\r\n}\r\n\r\np {\r\n	margin:0px;\r\n	padding: 0px;\r\n}\r\n\r\na:active,\r\na:visited,\r\na:link {\r\n	color: #4b719e;\r\n	text-decoration:none;\r\n}\r\n\r\na:hover {\r\n	color: #4b719e;\r\n	text-decoration: underline;\r\n}\r\n</style>\r\n</head>\r\n<body>\r\n{%content%}\r\n</body>\r\n</html>', 0)";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_category` (`id`, `parentid`, `posi`, `name`, `alt_name`, `icon`, `skin`, `descr`, `keywords`, `news_sort`, `news_msort`, `news_number`, `short_tpl`, `full_tpl`, `setlinks`, `forum_id`, `metatitle`, `catmain`, `rate`, `show_sub`, `allow_rss`) VALUES
(5, 212, 25, 'Интервью', 'interview', '/uploads/exclusive/img/1.jpg', '', 'Бизнесмены, политики делятся с нами своими мыслями', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(120, 0, 8, 'Блог', 'bloger', '', '', '', '', '', '', 0, 'members/blogi/blogishortstory', 'members/blogi/blogifullstory', 'no', 0, '', '', 0, 0, 0),
(143, 0, 3, 'В мире', 'v-mire', '', '', '', '', '', '', 0, '', '', 'yes', 0, '', 'yes', 0, 0, 0),
(144, 0, 4, 'Россия, СНГ', 'rossiya-sng', '', '', '', '', '', '', 0, '', '', 'no', 0, '', 'yes', 0, 0, 0),
(145, 0, 5, 'Спорт', 'sport', '', '', '', '', '', '', 0, '', '', 'no', 0, '', 'yes', 0, 0, 0),
(146, 0, 6, 'Авто', 'auto', '', '', '', '', '', '', 0, '', '', 'no', 0, '', 'yes', 0, 0, 0),
(147, 0, 7, 'Другое', 'drugoe', '', '', '', '', '', '', 0, '', '', 'yes', 0, '', 'yes', 0, 0, 0),
(213, 212, 26, 'Анатомия профессии', 'one_day', '/uploads/exclusive/img/3.jpg', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(212, 0, 24, 'Эксклюзивно', 'exclusive', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(214, 212, 27, 'F.A.Q. для кандидатов', 'faq', '/uploads/exclusive/img/6.jpg', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(215, 212, 28, 'Итоги года', 'itogi', '/uploads/exclusive/img/2.jpg', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(216, 212, 29, 'Репортажи с митингов', 'miting', '/uploads/exclusive/img/7.jpg', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(217, 212, 30, 'Тест-драйвы с VIP-персонами', 'vip-test-drive', '/uploads/exclusive/img/4.jpg', '', 'Первые люди города о машинах и делах', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(218, 212, 31, 'Репортажи с новостроек', 'progulki', '/uploads/exclusive/img/5.jpg', '', 'пустые дома накануне новоселья', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(219, 212, 32, 'Культурный город', 'culture', '/uploads/exclusive/img/8.jpg', '', 'Много интересных людей', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(237, 120, 10, 'МДД (мастерская добрых дел)', 'mdd-masterskaya-dobryh-del', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(238, 120, 11, 'Автомобильный', 'avtomobilnyy', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(239, 120, 12, 'Наши путешествия', 'nashi-puteshestviya', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(240, 120, 13, 'Наши походы', 'nashi-pohody', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(241, 120, 14, 'Фоторепортаж', 'fotoreportazh', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(242, 120, 15, 'Город: проблемы и решения', 'gorod-problemy-i-resheniya', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(243, 120, 16, 'Социальные и экономические стороны нашей жизни', 'socialnye-i-ekonomicheskie-storony-nashey-zhizni', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(244, 120, 17, 'Юмор', 'yumor', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(245, 120, 18, 'Студия творческих идей', 'studiya-tvorcheskih-idey', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(246, 120, 19, 'ЖКХ', 'zhkh', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(247, 120, 20, 'Наши опросы', 'nashi-oprosy', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(248, 120, 21, 'Дача, сад и огород', 'dacha-sad-i-ogorod', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(249, 120, 22, 'Библиотека книги/диски/прокат', 'biblioteka-knigi-diski-prokat', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0),
(250, 120, 23, 'Астрономия', 'astronomiya', '', '', '', '', '', '', 0, '', '', '', 0, '', '', 0, 0, 0)";
///

$add_time = time();
$thistime = date ("Y-m-d H:i:s", $add_time);

$tableSchema[] = "INSERT INTO " . PREFIX . "_static (`name`, `descr`, `template`, `allow_br`, `allow_template`, `grouplevel`, `tpl`, `metadescr`, `metakeys`, `views`, `template_folder`, `date`) VALUES ('dle-rules-page', 'Общие правила на сайте', '<b>Общие правила поведения на сайте:</b><br /><br />Начнем с того, что на сайте общаются сотни людей, разных религий и взглядов, и все они являются полноправными посетителями нашего сайта, поэтому если мы хотим чтобы это сообщество людей функционировало нам и необходимы правила. Мы настоятельно рекомендуем прочитать настоящие правила, это займет у вас всего минут пять, но сбережет нам и вам время и поможет сделать сайт более интересным и организованным.<br /><br />Начнем с того, что на нашем сайте нужно вести себя уважительно ко всем посетителям сайта. Не надо оскорблений по отношению к участникам, это всегда лишнее. Если есть претензии - обращайтесь к Админам или Модераторам (воспользуйтесь личными сообщениями). Оскорбление других посетителей считается у нас одним из самых тяжких нарушений и строго наказывается администрацией. <b>У нас строго запрещен расизм, религиозные и политические высказывания.</b> Заранее благодарим вас за понимание и за желание сделать наш сайт более вежливым и дружелюбным.<br /><br /><b>На сайте строго запрещено:</b> <br /><br />- сообщения, не относящиеся к содержанию статьи или к контексту обсуждения<br />- оскорбление и угрозы в адрес посетителей сайта<br />- в комментариях запрещаются выражения, содержащие ненормативную лексику, унижающие человеческое достоинство, разжигающие межнациональную рознь<br />- спам, а также реклама любых товаров и услуг, иных ресурсов, СМИ или событий, не относящихся к контексту обсуждения статьи<br /><br />Давайте будем уважать друг друга и сайт, на который Вы и другие читатели приходят пообщаться и высказать свои мысли. Администрация сайта оставляет за собой право удалять комментарии или часть комментариев, если они не соответствуют данным требованиям.<br /><br />При нарушении правил вам может быть дано <b>предупреждение</b>. В некоторых случаях может быть дан бан <b>без предупреждений</b>. По вопросам снятия бана писать администратору.<br /><br /><b>Оскорбление</b> администраторов или модераторов также караются <b>баном</b> - уважайте чужой труд.<br /><br /><div align=\"center\">{ACCEPT-DECLINE}</div>', 1, 1, 'all', '', 'Общие правила', 'Общие правила', 0, '', '{$add_time}')";
//$tableSchema[] = "INSERT INTO " . PREFIX . "_users (name, password, email, reg_date, lastdate, user_group, news_num, info, signature, favorites, xfields) values ('$reg_username', '$reg_password', '$reg_email', '$add_time', '$add_time', '1', '4', '', '', '', '')";
$tableSchema[] = "INSERT INTO " . PREFIX . "_vote (category, vote_num, date, title, body) VALUES ('all', '0', '$thistime', 'Оцените работу движка', 'Лучший из новостных<br />Неплохой движок<br />Устраивает ... но ...<br />Встречал и получше<br />Совсем не понравился')";

$title = "Добро пожаловать";
$short_story = "<div align=\"center\"><img src=\"".$url."uploads/boxsmall.png\" alt=\"\" /></div>";
$full_story = "Добро пожаловать на демонстрационную страницу системы Web2Work. Web2Work это многопользовательский готовый движок веб-портала, обладающий большими функциональными возможностями. Движок предназначен в первую очередь для создания городских порталов и социальных сетей с большим информационным контекстом. Однако он имеет большое количество настроек, которые позволяют использовать его практически для любых целей. Движок может быть интегрирован практически в любой существующий дизайн, и не имеет никаких ограничений по созданию шаблонов для него. Движок оптимизирован под поисковые системы. Обо всех функциональных особенностях вы сможете прочитать на <a href=\"https://web2work.ru/\" target=\"_blank\">нашей странице</a>.<br /><br />Обсуждение скрипта по всем вопросам ведется <a href=\"http://vkontakte.ru/web2work\" target=\"_blank\">здесь</a>. Так же там Вы сможете получить оперативную помощь.";

$tableSchema[] = "INSERT INTO " . PREFIX . "_post (id, date, autor, short_story, full_story, xfields, title, keywords, category, alt_name, allow_comm, approve, allow_main, tags) values ('1', '$thistime', '$reg_username', '$short_story', '$full_story', '', '$title', '', '147', 'post1', '1', '1', '1', 'по, новости')";

$title = "Приобретение и оплата";
$short_story = "Уважаемые вебмастера хотим для вас сделать небольшое дополнение. Прежде чем обратиться с каким-либо вопросом в службу поддержки скрипта, убедитесь что вы тщательно прочитали документацию по скрипту и не нашли там для вас необходимого ответа. Мы оставляем за собой право игнорировать вопросы, поступившие к нам от пользователей, использующих некоммерческую версию скрипта или не оплативших лицензию, включающую в себя службу технической поддержки. Вы можете приобрести один из двух типов лицензии на систему Web2Work по вашему желанию. После окончания срока лицензии вы можете ее продлить, либо использовать пожизненно бесплатно актуальную на тот момент времени версию веб-портала. В случае если вы захотите продлить лицензию для получения новых версий скрипта, то сделать это можно на <a href=\"https://web2work.ru/buy/\" target=\"_blank\">нашей странице</a><br /><br /><b>Как оплатить скрипт вы можете прочитать на</b> <a href=\"https://web2work.ru/buy/\" target=\"_blank\">http://web2work.ru/buy/</a><br /><br />Помните что лицензия выдается только на два домена и не может использоваться на других сайтах, а также запрещена передача вашего файла лицензии третьим лицам.<br /><br /><b>С уважением,<br /><br />Web2Work</b>";

$add_time = time()-20;
$thistime = date ("Y-m-d H:i:s", $add_time);

$tableSchema[] = "INSERT INTO " . PREFIX . "_post (id, date, autor, short_story, full_story, xfields, title, keywords, category, alt_name, allow_comm, approve, allow_main, tags) values ('2', '$thistime', '$reg_username', '$short_story', '$full_story', '', '$title', '', '147', 'post2', '1', '1', '1', 'по, новости')";

$title = "Шаблоны для разработок Web2Work";
$short_story = "<br /><div align=\"center\"><a href=\"https://web2work.ru/templates/\" target=\"_blank\"><img src=\"".$url."uploads/dlelogo.png\" alt=\"\" /></a></div><br />Мы рады предложить вам  также высококачественные шаблоны, специально подготовленные для использования под управлением Web2Work. Предлагаемые шаблоны созданы на высоком качественном уровне опытными дизайнерами и программистами. Каждый из предлагаемых шаблонов полностью настроен и готов к использованию сразу же после его установки на сервер. Помимо того что все шаблоны уже подготовлены к использованию на портале, вы получаете также все исходные материалы, которые были использованы при создании шаблона.<br /><br />Если вы еще только раздумываете как будет выглядеть ваш сайт и желаете воспользоваться услугами профессионалов по вполне разумным ценам, то мы рекомендуем вам обратиться к нам. Мы в сжатые строки создадим для вас персональный макет вашего портала, социальной сети, сайта знакомств, а также подготовим его непосредственно к работе с движком. Также приглашаем разработчиков выкладывать свои шаблоны в нашем разделе.";

$add_time = time()-50;
$thistime = date ("Y-m-d H:i:s", $add_time);

$tableSchema[] = "INSERT INTO " . PREFIX . "_post (id, date, autor, short_story, full_story, xfields, title, keywords, category, alt_name, allow_comm, approve, allow_main, tags) values ('3', '$thistime', '$reg_username', '$short_story', '$full_story', '', '$title', '', '147', 'post3', '1', '1', '1', 'по, шаблоны')";

$title = "Осуществление технической поддержки скрипта";
$short_story = "<b>Техническая поддержка скрипта</b> осуществляется силами <a href=\"https://web2work.ru/clients/\" target=\"_blank\">сайта поддержки разработки</a>, а также по E-Mail, ICQ. По мере поступления возникших у вас вопросов мы стараемся ответить на все ваши вопросы, но в связи с большим количеством посетителей, это не всегда является возможным. Поэтому введена дополнительная услуга платной поддержки скрипта. Срок поддержки составляет 1 год и продляется так же как и общая лицензия на обновления.<br /><br /><b>Услуги по дополнительной поддержки скрипта включают в себя:</b><br /><br />1. Приоритетное получение ответа на вопросы, которые задают пользователи впервые столкнувшиеся со скриптом и естественно не знающие всех нюансов работы скрипта. В компетенции службы поддержки находится только помощь только по непосредственным сбоям самого скрипта, в случае если причиной некорректной работы скрипта явился ваш шаблон, не соответствующий требованиям скрипта, то в поддержке вам может быть отказано.<br /><br />2. Также вы получаете возможность одноразовой установки скрипта вам на сервер, включая настройку его до полной работоспособности с учетом текущих настроек сервера (иногда нужно верно отключить поддержку ЧПУ, включение специальных директив для Русского Апача, для верной загрузки картинок и прочее...).<br /><br />3. Вы получаете консультационную поддержку по работе со структурой скрипта, например у вас есть желание добавить небольшие изменения в скрипт для более удобной работы для вас, вы сможете сэкономить время на поиске нужного куска кода просто спросив у нас. Вам будет предоставлена консультация где это копать и как вообще лучше реализовать поставленную задачу. (Внимание мы не пишем за вас дополнительные модули, а только помогаем вам лучше разобраться со структурой скрипта, поэтому всегда задавайте вопросы по существу, вопросы типа: \"как мне сделать такую фишку\" могут быть проигнорированы службой поддержки).<br /><br />4. Еще одна из часто возникающих проблем это некорректное обновление скрипта, например во время обновления произошел сбой сервера, часть новых данных была внесена в базу и настройки, часть нет, в итоге вы получаете нерабочий скрипт, со всеми вытекающими последствиями. В данном случае для вас будет проведена ручная коррекция поврежденной структуры базы данных.<br /><br />В случае если вы не являетесь подписчиком дополнительной службы поддержки, ваши вопросы могут быть проигнорированы и оставлены без ответа.<br /><br /><b>С уважением,<br /><br /> Web2Work</b>";

$add_time = time()-70;
$thistime = date ("Y-m-d H:i:s", $add_time);

$tableSchema[] = "INSERT INTO " . PREFIX . "_post (id, date, autor, short_story, full_story, xfields, title, keywords, category, alt_name, allow_comm, approve, allow_main, tags) values ('4', '$thistime', '$reg_username', '$short_story', '$full_story', '', '$title', '', '147', 'post4', '1', '1', '1', '')";

////////////////// ОПРЕДЕЛЯЮЩИЕ СБОРКИ /////////////////////////////
require_once(ROOT_DIR.'/install/db_post.php');
////////////////////////////////////////////////////////////////////
$tableSchema[] = "INSERT INTO " . PREFIX . "_post_extras (news_id, user_id) values ('1', '1'), ('2', '1'), ('3', '1'), ('4', '1')";
    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_post_extras` ADD INDEX `rating` (`rating`), ADD INDEX `news_read` (`news_read`)";

    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_post` CHANGE `tags` `tags` VARCHAR(250) NOT NULL DEFAULT ''";

    $tableSchema[] = "ALTER TABLE `" . PREFIX . "_static` CHANGE `template` `template` MEDIUMTEXT NOT NULL";

$tableSchema[] = "INSERT INTO " . PREFIX . "_tags (news_id, tag) values ('1', 'по'), ('2', 'по'), ('3', 'по'), ('1', 'новости'), ('2', 'новости'), ('3', 'шаблоны')";

include ENGINE_DIR.'/classes/mysql.php';
include ENGINE_DIR.'/data/dbconfig.php';

      foreach($tableSchema as $table) {

        $db->query($table);

      }

  echo $skin_header;


echo <<<HTML
<form action="install_step1.php" method="get">
<input type="hidden" name="reg_name" value="$reg_username">
<input type="hidden" name="reg_password" value="$reg_password">
<input type="hidden" name="regmail" value="$reg_email">
<div class="box">
  <div class="box-header">
    <div class="title">Первый шаг установки завершен</div>
  </div>
  <div class="box-content">
	<div class="row box-section">
Настройки файлов и базы данных успешно сформированы. Первый шаг установки успешно завершен. На следующем шаге определяются параметры портала и настройки основных модулей.<br><br>
	<b>Файлы для CRON (Задания по расписанию):</b>
		<div style="margin-top:5px;">
		<ul class="import" style="margin-left:15px;">
			<li>/cron/rating_cron.php - обновление рейтинга сайтов за сутки</li>
			<li>/cron/rating_hcron.php - обновление рейтинга сайтов за час</li>
			<li>/cron/cron.rss.php - выгрузка новостей из лент добавленных в панели управления</li>
			<li>/cron/import_tv.php - выгрузка тв программ</li>
			<li>/cron/cron_cacheinfo.php - сброс и обновление кеш данных портала</li>
			<li>/cron/import_autoobj.php - выгрузка автообъявлений</li>
			<li>/cron/import_current.php - выгрузка погоды за час</li>
			<li>/cron/import_forecast.php - выгрузка погоды на 3 дня вперед</li>
			<li>/cron/import_kurs.php - выгрузка курса валют</li>
			<li>/cron/import_nedv_obj.php - выгрузка объявлений недвижимости</li>
			<li>/cron/import_nedv_predl.php - выгрузка предложений недвижимости</li>
			<li>/cron/import_workobj.php - выгрузка вакансий</li>
		</ul>
		</div>
	</div>
	<div class="row box-section">
		<input class="btn btn-green" type=submit value="Продолжить">
	</div>

  </div>
</div>

HTML;

}
else {

	if (@file_exists(ENGINE_DIR.'/data/config.php')) {

		msgbox( "", "Установка скрипта автоматически заблокирована", "Внимание, на сервере обнаружена уже установленная копия DataLife Engine. Если вы хотите еще раз произвести установку скрипта, то вам необходимо вручную удалить файл <b>/engine/data/config.php</b>, используя FTP протокол." );

		die ();
	}

$_SESSION['dle_install'] = 1;

// ********************************************************************************
// Приветствие
// ********************************************************************************

  echo $skin_header;

echo <<<HTML
<form method="get" action="">
<input type="hidden" name="action" value="eula">
<div class="box">
  <div class="box-header">
    <div class="title">Мастер установки</div>
  </div>
  <div class="box-content">
	<div class="row box-section">
	Добро пожаловать в мастер установки системы от Web2Work. Данный мастер поможет вам установить скрипт всего за несколько минут. Однако, не смотря на это, мы настоятельно рекомендуем Вам ознакомиться с документацией по работе со скриптом, а также по его установке, которая поставляется вместе со скриптом.<br><br>
	Прежде чем начать установку убедитесь, что все файлы дистрибутива загружены на сервер, а также выставлены необходимые права доступа для папок и файлов.<br><br>
	Обращаем Ваше внимание на то, что наша система поддерживает работу с ЧПУ, а для этого необходимо, чтобы был установлен модуль <b>modrewrite</b> и его использование было разрешено. Eсли вы хотите отключить эту возможность, то удалите файл <b>.htaccess</b> в корневой папке и в процессе установки скрипта отключите поддержку этой функции.<br><br>
	<font color="red">Внимание: при установке скрипта создается структура базы данных, создается аккаунт администратора, а также прописываются основные настройки системы, поэтому после успешной установки удалите файл <b>install.php</b> во избежание повторной установки скрипта!</font><br><br>
	Приятной Вам работы,<br>
	Web2Work
	</div>
	<div class="row box-section">
		<input class="btn btn-green" type=submit value="Начать установку">
	</div>

  </div>
</div>
</form>
HTML;
}


echo $skin_footer;
?>