<?PHP

$tableSchema[] = "INSERT INTO `".PREFIX."_testpartnerov` (`id`, `vote_1`, `vote_2`, `field0`) VALUES
(1, 'Настроение и самочувствие человека зависит от удовлетворения его сексуальных потребностей', 'Настроение и самочувствие человека зависит от удовлетворения его сексуальных потребностей.', ''),
(2, 'Счастье в браке зависит от сексуальной гармонии супругов.', 'Счастье в браке зависит от сексуальной гармонии супругов.', ''),
(3, 'Сексуальные отношения – главное в отношениях мужа и жены.', 'Сексуальные отношения–главное в отношениях мужа и жены.', ''),
(4, 'Главное в браке–чтобы у мужа и жены было много общих интересов.', 'Главное в браке–чтобы у мужа и жены было много общих интересов.', ''),
(5, 'Жена–это друг, который разделяет мои интересы, мнения, увлечения.', 'Муж–это друг, который разделяет мок интересы, мнения, увлечения.', ''),
(6, 'Жена – это, прежде всего друг, с которым можно поговорить о своих делах.', 'Муж – это, прежде всего друг, с которым можно поговорить о своих делах.', ''),
(7, 'Самая главная забота жены– чтобы в семье все были накормлены и ухожены.', 'Самая главная забота мужа – обеспечить материальный достаток и бытовой комфорт семьи.', ''),
(8, 'Женщина многое теряет в моих глазах, если она плохая хозяйка.', 'Муж должен заниматься домашним хозяйством наравне с женой.', ''),
(9, 'Женщина может гордиться собой, если она хорошая хозяйка своего дома.', 'Муж должен уметь обслужить себя, а не ждать, что жена возьмет на себя все заботы о нем.', ''),
(10, 'Я хотел бы, чтобы моя жена любила детей и была им хорошей матерью.', 'Муж должен заниматься детьми не меньше, чем жена.', ''),
(11, 'Женщина, которая тяготится материнством, неполноценная женщина.', 'Я хотела бы, чтобы мой муж любил детей.', ''),
(12, 'Для меня главное в женщине, чтобы она была хорошей матерью моим детям.', 'О мужчине я сужу по тому, хороший или плохой он отец своим детям.', ''),
(13, 'Мне нравятся деловые и энергичные женщины.', 'Мне нравятся энергичные, деловые мужчины.', ''),
(14, 'Я очень ценю женщин, всерьез увлеченных своим делом.', 'Я очень ценю мужчин, серьезно увлеченных своим делом.', ''),
(15, 'Для меня очень важно, как оценивают на работе деловые и профессиональные качества моей жены.', 'Для меня очень важно, как оценивают на работе деловые и профессиональные качества моего мужа.', ''),
(16, 'Жена должна, прежде всего, создавать и поддерживать теплую, доверительную атмосферу в семье.', 'Муж должен уметь создавать в семье теплую, доверительную атмосферу.', ''),
(17, 'Для меня главное–чтобы моя жена хорошо понимала меня и принимала таким, каков я есть.', 'Для меня главное–чтобы мой муж хорошо понимал меня и принимал такой, какая я есть.', ''),
(18, 'Жена – это, прежде всего друг, который внимателен и заботлив к моим переживаниям, настроению, состоянию.', 'Муж – это, прежде всего друг, который внимателен и заботлив к моим переживаниям, настроению, состоянию.', ''),
(19, 'Мне очень нравится, когда моя жена красиво и модно одета.', 'Мне нравится, когда мой муж красиво и модно одет.', ''),
(20, 'Я очень ценю женщин, умеющих красиво одеваться.', 'Мне нравятся видные, рослые мужчины.', ''),
(21, 'Женщина должна выглядеть так, чтобы на нее обращали внимание.', 'Мужчина должен выглядеть так, чтобы на него было приятно посмотреть.', ''),
(22, 'Я всегда знаю, что нужно купить для нашего дома.', 'Самая главная забота женщины, чтобы в семье все были обихожены.', ''),
(23, 'Я люблю заниматься домашними делами.', 'Я всегда знаю, что нужно купить для моей семьи.', ''),
(24, 'Я могу сделать ремонт и отделку квартиры, починку бытовой техники.', 'Я собираю полезные советы хозяйке: как готовить вкусные блюда, консервировать овощи, фрукты.', ''),
(25, 'Деты любят играть со мной, охотно общаются, идут на руки.', 'Главную роль в воспитании ребенка всегда играет мать.', ''),
(26, 'Я очень люблю детей и умею с ними заниматься.', 'Я не боюсь трудностей, связанных с рождением и воспитанием ребенка.', ''),
(27, 'Я принимал бы активное участие в воспитании своего ребенка, даже если бы мы с женой решили расстаться.', 'Я люблю детей и с удовольствием занимаюсь с ними.', ''),
(28, 'Я стремлюсь добиться своего места в жизни.', 'Я стремлюсь добиться своего места в жизни.', ''),
(29, 'Я хочу стать хорошим специалистом своего дела.', 'Я хочу стать хорошим специалистом своего дела.', ''),
(30, 'Я горжусь, когда мне поручают трудную и ответственную работу.', 'Я горжусь, когда мне поручают трудную и ответственную работу.', ''),
(31, 'Близкие и друзья часто обращаются ко мне за советом, помощью и поддержкой.', 'Близкие и друзья часто обращаются ко мне за советом, помощью и поддержкой.', ''),
(32, 'Окружающие часто доверяют мне свои беды.', 'Окружающие часто доверяют мне свои беды.', ''),
(33, 'Я всегда искренне и с чувством сострадания утешаю и опекаю нуждающихся в этом людей.', 'Я всегда искренне и с чувством сострадания утешаю и опекаю нуждающихся в этом людей.', ''),
(34, 'Мое настроение во многом зависит от того, как я выгляжу.', 'Мое настроение во многом зависит от того, как я выгляжу.', ''),
(35, 'Я стараюсь носить ту одежду, которая мне идет.', 'Я люблю красивую одежду, ношу украшения, употребляю косметику.', ''),
(36, 'Я придирчиво отношусь к покрою костюма, фасону рубашки, цвету галстука.', 'Я придаю большое значение своему внешнему виду.', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_testsnimki` VALUES (1, '/templates/".$skin."/images/testsnimok/clip_image001.jpg', 'Близость', 'Ведущую роль играет возможность дотрагиваться до другого, его обнимать и приникать к нему. Вероятно, вы пытаетесь обрести в этих отношениях некий физический контакт, дающий ощущение стабильности и защищенности. Нежность, непринужденность и доверие занимают верхние строчки в вашей личной иерархии семейных ценностей. Ваше счастье зависит от способности вашего партнера разделить с вами эти приоритеты. ', 'Пара для вас – это прежде всего надежность, стабильность, защищенность. Ваше любовное чувство тесно связано с желанием общности и нежности. Вы отдаете себе отчет в своей уязвимости или в уязвимости партнера, что служит поводом построить по-настоящему близкие и открытые отношения. Однако вы рискуете впасть в полное «слияние», когда человек не различает себя и другого, или застыть в раз и навсегда избранных взаимодополняющих ролях типа. В этом случае один из партнеров призван восполнять то, чего недостает другому, но со временем такие отношения рискуют закоснеть, а любовное чувство может смениться горечью и враждебностью. Если пустить отношения на самотек, со временем такие отношения могут закоснеть, а любовное чувство может смениться горечью и враждебностью.')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_testsnimki` VALUES (2, '/templates/".$skin."/images/testsnimok/clip_image002.jpg', 'Социальность', 'Эта фотография соответствует «перевернутой» предыдущей модели. Если вы женщина, то связываете недостаток самоутверждения у мужчины с его тонкой душевной организацией, поскольку не выносите мачо. Но тут необходима осторожность: мужчина должен преуспеть в утверждении собственной воли, иначе он, возможно, захочет освободиться от чрезмерной женской власти.', 'Вы не представляете себе жизнь в паре без планов, целей, к которым нужно стремиться. В глубине души вы знаете, что выбрали (или выберете) своего партнера, потому что он красивый, известный, привлекательный... В паре вы цените успешность, вы любите, когда вас видят вместе, и избегаете «обезличивающих» ситуаций. Если пара другого типа любит уединение спальни, а всем курортам предпочтет необитаемый остров, то вам больше нравится гостиная, а бывать вы любите там, где все на виду. Ваша пара умеет сделать так, чтобы ее оценили, и легко завязывает и поддерживает знакомства. Но существует риск того, что отношения, обращенные исключительно «вовне», незаметно сделают каждого из партнеров пленником его социальной роли, которую ему приходится постоянно отстаивать. В результате отношения становятся менее близкими, в них недостает способности воспринимать то хрупкое, что есть в другом и в себе, и из них может уйти нежность')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_testsnimki` VALUES (7, '/templates/".$skin."/images/testsnimok/clip_image007.jpg', 'Социальность', 'Это модель успешной пары, такой, которая пробуждает восхищение и зависть. Вместе вы выглядите блестяще. Вы не знаете, что значит проигрывать, и именно в этом может быть слабость вашей пары. ', 'Вы не представляете себе жизнь в паре без планов, целей, к которым нужно стремиться. В глубине души вы знаете, что выбрали (или выберете) своего партнера, потому что он красивый, известный, привлекательный... В паре вы цените успешность, вы любите, когда вас видят вместе, и избегаете «обезличивающих» ситуаций. Если пара другого типа любит уединение спальни, а всем курортам предпочтет необитаемый остров, то вам больше нравится гостиная, а бывать вы любите там, где все на виду. Ваша пара умеет сделать так, чтобы ее оценили, и легко завязывает и поддерживает знакомства. Но существует риск того, что отношения, обращенные исключительно «вовне», незаметно сделают каждого из партнеров пленником его социальной роли, которую ему приходится постоянно отстаивать. В результате отношения становятся менее близкими, в них недостает способности воспринимать то хрупкое, что есть в другом и в себе, и из них может уйти нежность')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_testsnimki` VALUES (3, '/templates/".$skin."/images/testsnimok/clip_image003.jpg', 'Сексуальность', 'Ваша сексуальность строится вокруг соблазнения и имиджа. Для вас важно, чтобы партнер был красивый, заметный и пользующийся известностью. Вы воспринимаете сексуальность как способ выйти на сцену и продемонстрировать свою успешность. Такая игра очень стимулирует, а сопровождающее ее желание может быть очень сильным. Но это очень неустойчивое положение: вам приходится постоянно доказывать, что созданный образ удачен, что вы предстали в самом выгодном свете. Сексуальное соблазнение вполне может быть основой, на которой пара возникла, но для дальнейшего расцвета сексуальности нужно двигаться в сторону большей близости и уверенности.', 'Сексуальность для вас является важнейшим измерением отношений. Вы не представляете гармоничного развития вашей пары без поддержания интенсивного желания и без достижения наслаждения. Ваше любовное чувство зависит от качества и глубины секса. Это придает паре определенный динамизм и может способствовать глубокому и позитивному развитию ваших отношений, поддерживать очень сильное чувство близости и общности.')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_testsnimki` VALUES (4, '/templates/".$skin."/images/testsnimok/clip_image004.jpg', 'Сексуальность', 'Вас привлекает интимная близость. Вы любите чувственность, контакт с телом другого и игру с ним; любите прикасаться, чувствовать прикосновения и благодаря такому общению тел ощущать, что живете по-настоящему. Сексуальность вас привлекает, но сохраняет некоторую таинственность; вы воспринимаете ее как смесь желаний, неуверенности, фантазий, а иногда суждений и сомнений по поводу поступков вашего партнера и вас самих. Вы ясно чувствуете, что сексуальное раскрытие вашей пары должно соединять телесную близость с близостью в отношениях, при которой вы будете лучше знать друг друга, удовлетворять и себя, и партнера, взаимно раскрываться навстречу желаниям друг друга. Если вы рискнете развивать вашу сексуальную близость в этом направлении, история вашей пары сможет опровергнуть распространенное мнение, согласно которому время и привычка ослабляют сексуальное желание.', 'Сексуальность для вас является важнейшим измерением отношений. Вы не представляете гармоничного развития вашей пары без поддержания интенсивного желания и без достижения наслаждения. Ваше любовное чувство зависит от качества и глубины секса. Это придает паре определенный динамизм и может способствовать глубокому и позитивному развитию ваших отношений, поддерживать очень сильное чувство близости и общности.')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_testsnimki` VALUES (5, '/templates/".$skin."/images/testsnimok/clip_image005.jpg', 'Социальность', 'В данном случае отношения строятся вокруг доминирующего положения мужчины. Это соответствует традиционному представлению о мужественности. Если вы женщина, вы восхищаетесь своим партнером, а его способность занять высокое положение в обществе вас обнадеживает и компенсирует свойственный вам недостаток уверенности в себе. Между тем эта социальная модель, еще недавно широко распространенная, сегодня иногда дает сбой. Женщина нередко подспудно восстает против власти мужчины. В свою очередь у мужчины появляются претензии к партнерше. Поэтому очень важно учиться более близкому общению в паре.', 'Вы не представляете себе жизнь в паре без планов, целей, к которым нужно стремиться. В глубине души вы знаете, что выбрали (или выберете) своего партнера, потому что он красивый, известный, привлекательный... В паре вы цените успешность, вы любите, когда вас видят вместе, и избегаете «обезличивающих» ситуаций. Если пара другого типа любит уединение спальни, а всем курортам предпочтет необитаемый остров, то вам больше нравится гостиная, а бывать вы любите там, где все на виду. Ваша пара умеет сделать так, чтобы ее оценили, и легко завязывает и поддерживает знакомства. Но существует риск того, что отношения, обращенные исключительно «вовне», незаметно сделают каждого из партнеров пленником его социальной роли, которую ему приходится постоянно отстаивать. В результате отношения становятся менее близкими, в них недостает способности воспринимать то хрупкое, что есть в другом и в себе, и из них может уйти нежность')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_testsnimki` VALUES (6, '/templates/".$skin."/images/testsnimok/clip_image006.jpg', 'Близость', 'Если вы мужчина, то вам, вероятно, непросто сочетать в себе уязвимость с мужественностью. С одной стороны, надо решиться предстать перед партнером со всеми своими сомнениями, а с другой – доминировать в отношениях, со всей возможной силой и без колебаний утверждая свою волю.\r\n Если вы женщина, то у вас тоже, должно быть, присутствует противоречие между потребностью отдаться счастью любовной зависимости и страх\r\n', 'Пара для вас – это прежде всего надежность, стабильность, защищенность. Ваше любовное чувство тесно связано с желанием общности и нежности. Вы отдаете себе отчет в своей уязвимости или в уязвимости партнера, что служит поводом построить по-настоящему близкие и открытые отношения. Однако вы рискуете впасть в полное «слияние», когда человек не различает себя и другого, или застыть в раз и навсегда избранных взаимодополняющих ролях типа. В этом случае один из партнеров призван восполнять то, чего недостает другому, но со временем такие отношения рискуют закоснеть, а любовное чувство может смениться горечью и враждебностью. Если пустить отношения на самотек, со временем такие отношения могут закоснеть, а любовное чувство может смениться горечью и враждебностью.')";
$tableSchema[] = "INSERT INTO `" . PREFIX . "_testsnimki` VALUES (8, '/templates/".$skin."/images/testsnimok/clip_image008.jpg', 'Родительский проект', 'Ваша пара основывается на желании создать семью. Пока между вами существует полное единодушие по поводу этого проекта, все в порядке. Создание своего очага может принести много радости и теплых чувств, даже если при этом приходится иногда расплачиваться ослаблением любовного пыла. Однако если построение личных отношений оказывается подчинено проекту строительства семьи, то вы и ваш супруг рискуете оказаться пленниками отцовской и материнской ролей в ущерб вашей самореализации как мужчины и женщины. Однако, вам есть прямой смысл наряду со своей семейной жизнью бывать иногда вдвоем, выделять время для любовных свиданий без детей. Атмосфера в доме от этого станет только лучше, а будущее семьи – лучезарнее.', 'Поразмышляйте о втором выбранном вами снимке, чтобы понять, каким образом можно сбалансировать ваши отношения в паре за счет этой второй модели.')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_alkogol` (`id`, `name`, `alt_name`) VALUES
('1', 'Не пью вообще', ''),
('2', 'Пью в компаниях изредка', ''),
('3', 'Люблю выпить', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_brak` (`id`, `name`, `alt_name`) VALUES
('1', 'Да, женат, живем вместе', 'Да, замужем, живем вместе'),
('2', 'Да, женат, живем порознь', 'Да, замужем, живем порознь'),
('3', 'Да, женат, «для вида»', 'Да, замужем, для вида'),
('4', 'Нет, не женат', 'Нет, не замужем')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_bududelat_svobodniy` (`id`, `name`, `alt_name`) VALUES
('1', 'Пойду гулять', 'gulat'),
('2', 'Буду читать дома', 'chitat'),
('3', 'Побуду в одиночестве', ''),
('4', 'Приглашу гостей', ''),
('5', 'Поеду на природу', ''),
('6', 'Пойду в кино', ''),
('7', 'Пойду в театр', ''),
('8', 'Пойду в музей', ''),
('9', 'Пойду в ресторан', ''),
('10', 'Пойду в ночной клуб', ''),
('11', 'Займусь спортом', ''),
('12', 'Поиграю на компьютере', ''),
('13', 'Посижу в интернете', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_celi_znakomstva` (`id`, `name`, `alt_name`) VALUES
('1', 'Общение', 'obsh'),
('2', 'Секс на один-два раза', 'proso')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_deti` (`id`, `name`, `alt_name`) VALUES
('1', 'Нет', ''),
('2', 'Нет, но хотелось бы', ''),
('3', 'Есть, живем вместе', ''),
('4', 'Есть, живем порознь', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_geteroopit` (`id`, `name`, `alt_name`) VALUES
('1', 'Да, жили вместе', ''),
('2', 'Да, только секс', ''),
('3', 'Небольшой', ''),
('4', 'Нет', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_ishu` (`id`, `name`, `descr`, `value`, `col`) VALUES
(1, 'клаббер', '', '', 0),
(2, 'слушатель', '', '', 0),
(3, 'DJ', '', '', 0),
(4, 'музыкант', '', '', 0),
(5, 'вокалист', '', '', 0),
(6, 'поэт', '', '', 0),
(7, 'промоутер', '', '', 0),
(8, 'клубный фотограф', '', '', 0),
(9, 'фотограф', '', '', 0),
(10, 'Арт-директор', '', '', 0),
(12, 'Представитель Ночного Клуба', '', '', 0)";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_kakseks` (`id`, `name`, `alt_name`) VALUES
('1', 'Несколько раз в день', ''),
('2', 'Хотя бы раз в день', ''),
('3', 'Несколько раз в неделю', ''),
('4', 'Несколько раз в месяц', ''),
('5', 'Для меня секс не очень важен', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_kurenie` (`id`, `name`, `alt_name`) VALUES
('1', 'Не курю вообще', ''),
('2', 'Курю', ''),
('3', 'Редко', ''),
('4', 'Бросаю', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_mater_podderzhka` (`id`, `name`, `alt_name`) VALUES
('1', 'Хочу найти спонсора', ''),
('2', 'Готов стать спонсором', ''),
('3', 'Не нуждаюсь в спонсоре и не хочу им быть', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_narkotik` (`id`, `name`, `alt_name`) VALUES
('1', 'Никогда не принимал', ''),
('2', 'Категорически не приемлю', ''),
('3', 'Покуриваю «травку»', ''),
('4', 'Принимаю легкие', ''),
('5', 'Принимаю тяжелые', ''),
('6', 'Бросаю', ''),
('7', 'Выздоравливаю по NA', ''),
('8', 'Бросил', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_orientacia` (`id`, `name`, `alt_name`) VALUES
('1', 'Гетеро', ''),
('2', 'Би', '')";

$tableSchema[] = "INSERT INTO `" . PREFIX . "_znakomlus_s` (`id`, `name`, `alt_name`) VALUES
(1, 'Парнем', ''),
(2, 'Девушкой', ''),
(3, 'Пара М+Ж', ''),
(4, 'Пара Ж+Ж', ''),
(5, 'Пара М+М', '')";
?>