<?PHP

$tableSchema[] = "INSERT INTO ".PREFIX."_forum_category VALUES (1, 'Свободное общение', 2)";
$tableSchema[] = "INSERT INTO ".PREFIX."_forum_category VALUES (5, 'Авто обсуждения', 3)";

$tableSchema[] = "INSERT INTO ".PREFIX."_forum_forums VALUES (1, 0, 1, 1, 0, 'Замечания и баги по проекту', '', 1, 1, '1:2:3:4:5', '1:2:3:4', '1', '1:2:3:4', '1:2', '1:2:3:4', 1, '', '', '', '', '', '', '', '')";
$tableSchema[] = "INSERT INTO ".PREFIX."_forum_forums VALUES (2, 0, 1, 0, 0, 'Свободное общение', '', 2, 1, '1:2', '1:2', '1:2', '1:2', '1:2', '1:2', 0, '', '0000-00-00 00:00:00', '', '', '', '', '', '')";
$tableSchema[] = "INSERT INTO ".PREFIX."_forum_forums VALUES (3, 0, 1, 0, 0, 'IT-форум', '', 3, 1, '1:2:3:4:5:6:7', '1:2:3:4:6:7', '1', '1:2:3:4:6:7', '1:2:3:4:5:7', '1:2:3:4:5:7', 0, '', '0000-00-00 00:00:00', '', '', '', '', '', '')";
$tableSchema[] = "INSERT INTO ".PREFIX."_forum_forums VALUES (4, 0, 1, 0, 0, 'Предложения по проекту', '', 4, 1, '1:2:3:4:5:6:7', '1:2:3:4:5:7', '1', '1:2:3:4:5:7', '1:2:3:4:5:7', '1:2:3:4:5:6:7', 0, '', '0000-00-00 00:00:00', '', '', '', '', '', '')";
$tableSchema[] = "INSERT INTO ".PREFIX."_forum_forums VALUES (36, 0, 5, 3, 0, 'Что купить', '', 1, 1, '1:2:3:4:5', '1:2:3:4', '1:2', '1:2:3:4', '1:2:3:4', '1:2:3:4', 7, '', '', '', '', '', '', '', '')";

?>